revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_MESH
// OTA to mesh devices
static uint8_t mesh_root_known = 0;
static volatile uint8_t mesh_ota_ack = 0;
static SemaphoreHandle_t mesh_ota_sem = NULL;
static mesh_addr_t mesh_ota_addr = { };

#endif

/* Local functions */
static int revk_upgrade_check (const char *url);
#ifdef	CONFIG_REVK_APCONFIG
static httpd_handle_t webserver = NULL;
#endif
#ifdef	CONFIG_REVK_APMODE
static volatile uint8_t dummy_dns_task_end = 0;
static uint32_t apstoptime = 0; // When to stop AP mode (uptime)
static void ap_start (void);    // Start AP mode, allowed if already running
static void ap_stop (void);     // Stop AP mode, allowed if if not running
#endif

static void ip_event_handler (void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data);
static void mqtt_rx (void *arg, char *topic, unsigned short plen, unsigned char *payload);
static const char *revk_upgrade (const char *target, jo_t j);

#ifdef	CONFIG_REVK_MESH
static void mesh_init (void);
void mesh_make_mqtt (mesh_data_t * data, uint8_t tag, int tlen, const char *topic, int plen, const unsigned char *payload);
static SemaphoreHandle_t mesh_mutex = NULL;
#endif

#if defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
static void
makeip (esp_netif_ip_info_t * info, const char *ip, const char *gw)
{
   char *i = strdup (ip);
   int cidr = 24;
   char *n = strrchr (i, '/');
   if (n)
   {
      *n++ = 0;
      cidr = atoi (n);
   }
   esp_netif_set_ip4_addr (&info->netmask, (0xFFFFFFFF << (32 - cidr)) >> 24, (0xFFFFFFFF << (32 - cidr)) >> 16,
                           (0xFFFFFFFF << (32 - cidr)) >> 8, (0xFFFFFFFF << (32 - cidr)));
   REVK_ERR_CHECK (esp_netif_str_to_ip4 (i, &info->ip));
   if (!gw || !*gw)
      info->gw = info->ip;
   else
      REVK_ERR_CHECK (esp_netif_str_to_ip4 (gw, &info->gw));
   freez (i);
}
#endif

#ifdef CONFIG_REVK_MESH
esp_err_t
mesh_safe_send (const mesh_addr_t * to, const mesh_data_t * data, int flag, const mesh_opt_t opt[], int opt_count)
{                               // Mutex to protect non-re-entrant call
   if (!esp_mesh_is_device_active ())
      return ESP_ERR_MESH_DISCONNECTED;
   if (!to && !esp_mesh_is_root () && !mesh_root_known)
      return ESP_ERR_MESH_DISCONNECTED; // We are not root and root address not known
   xSemaphoreTake (mesh_mutex, portMAX_DELAY);
   esp_err_t e = esp_mesh_send (to, data, flag, opt, opt_count);
   xSemaphoreGive (mesh_mutex);
   static uint8_t fails = 0;
   if (e)
   {
      if (e != ESP_ERR_MESH_DISCONNECTED)
         ESP_LOGI (TAG, "Mesh send failed:%s (%d)", esp_err_to_name (e), data->size);
      if (e == ESP_ERR_MESH_NO_MEMORY)
      {
         if (++fails > 100)
            revk_restart ("ESP_ERR_MESH_NO_MEMORY", 1); // Messy, catch memory leak
      }
   } else
      fails = 0;
   return e;
}
#endif

#ifdef CONFIG_REVK_MESH
// TODO esp_mesh_set_ie_crypto_funcs may be better way to do this in future - but need to de-dup if mesh system not fixed!
esp_err_t
mesh_encode_send (mesh_addr_t * addr, mesh_data_t * data, int flags)
{                               // Security - encode mesh message and send - **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
   // Note, at this point this does not protect against replay - critical messages should check timestamps to mitigate against replay
   // Add padding
   uint8_t pad = 15 - (data->size & 15);        // Padding
   data->size += pad;
   // Add padding len
   data->data[data->size++] = pad;      // Last byte in 16 byte block is how much padding
   // Encrypt
   uint8_t iv[16];              // Changes by the encrypt
   esp_fill_random (iv, 16);    // IV
   memcpy (data->data + data->size, iv, 16);
   esp_aes_context ctx;
   esp_aes_init (&ctx);
   esp_aes_setkey (&ctx, meshkey, 128);
   esp_aes_crypt_cbc (&ctx, ESP_AES_ENCRYPT, data->size, iv, data->data, data->data);
   esp_aes_free (&ctx);
   // Add IV
   data->size += 16;
   return mesh_safe_send (addr, data, flags, NULL, 0);
}
#endif

#ifdef CONFIG_REVK_MESH
esp_err_t
mesh_decode (mesh_addr_t * addr, mesh_data_t * data)
{                               // Security - decode mesh message
   addr = addr;                 // Not used
   if (data->size < 32 || (data->size & 15))
   {
      ESP_LOGE (TAG, "Bad mesh rx len %d", data->size);
      return -1;
   }
   // Remove IV
   data->size -= 16;
   uint8_t *iv = data->data + data->size;
   static uint8_t lastiv[16] = { };
   if (!memcmp (lastiv, iv, 16))
   {                            // Check for duplicate
      ESP_LOGI (TAG, "Duplicate mesh rx %d: %02X %02X %02X %02X...", data->size, iv[0], iv[1], iv[2], iv[3]);
      return -2;                // De-dup
   }
   memcpy (lastiv, iv, 16);
   // Decrypt
   esp_aes_context ctx;
   esp_aes_init (&ctx);
   esp_aes_setkey (&ctx, meshkey, 128);
   esp_aes_crypt_cbc (&ctx, ESP_AES_DECRYPT, data->size, iv, data->data, data->data);
   esp_aes_free (&ctx);
   // Remove padding len
   data->size--;
   if (data->data[data->size] > 15)
   {
      ESP_LOGE (TAG, "Bad mesh rx pad %d", data->data[data->size]);
      return -3;
   }
   // Remove padding
   data->size -= data->data[data->size];
   data->data[data->size] = 0;  // Original expected a null
   return 0;
}
#endif

#ifdef CONFIG_REVK_MESH
static void
mesh_task (void *pvParameters)
{                               // Mesh root
   pvParameters = pvParameters;
   mesh_data_t data = { };
   data.data = malloc (MESH_MPS + 1);   // One extra for a null
   while (1)
   {                            // Mesh receive loop
      mesh_addr_t from = { };
      data.size = MESH_MPS;
      int flag = 0;
      esp_err_t e = esp_mesh_recv (&from, &data, 1000, &flag, NULL, 0);
      if (e)
      {
         if (e == ESP_ERR_MESH_NOT_START)
            sleep (1);
         else if (e != ESP_ERR_MESH_TIMEOUT)
         {
            ESP_LOGI (TAG, "Rx %s", esp_err_to_name (e));
            usleep (100000);
         }
         continue;
      }
      mesh_root_known = 1;      // We are root or we got from root, so let's mark known
      data.data[data.size] = 0; // Add a null so we can parse JSON with NULL and log and so on
      char mac[13];
      sprintf (mac, "%02X%02X%02X%02X%02X%02X", from.addr[0], from.addr[1], from.addr[2], from.addr[3], from.addr[4], from.addr[5]);
      // We use MESH_PROTO_BIN for flash (unencrypted)
      // We use MESH_PROTO_MQTT to relay
      // We use MESH_PROTO_JSON for messages internally
      if (data.proto == MESH_PROTO_BIN)
      {                         // Includes loopback to self
         static uint8_t ota_ack = 0;    // The ACK we send
         static int ota_size = 0;       // Total size
         static int ota_data = 0;       // Data received
         static esp_ota_handle_t ota_handle;
         static const esp_partition_t *ota_partition = NULL;
         static int ota_progress = 0;
         static uint32_t next = 0;
         uint32_t now = uptime ();
         uint8_t type = *data.data;
         void send_ack (void)
         {                      // ACK (to root)
            if (ota_ack)
            {
               mesh_data_t data = {.data = &ota_ack,.size = 1,.proto = MESH_PROTO_BIN };
               REVK_ERR_CHECK (mesh_safe_send (&from, &data, MESH_DATA_P2P, NULL, 0));
            }
         }
         switch (type >> 4)
         {
         case 0x5:             // Start - not checking sequence, expecting to be 0
            if (data.size == 4)
            {
               ota_ack = 0xA0 + (*data.data & 0xF);
               send_ack ();
               if (!ota_size)
               {
                  ota_size = (data.data[1] << 16) + (data.data[2] << 8) + data.data[3];
                  ota_partition = esp_ota_get_next_update_partition (esp_ota_get_running_partition ());
                  ESP_LOGI (TAG, "Start flash %d", ota_size);
                  jo_t j = jo_make (NULL);
                  jo_int (j, "size", ota_size);
                  revk_info_clients ("upgrade", &j, -1);
                  if (REVK_ERR_CHECK (esp_ota_begin (ota_partition, ota_size, &ota_handle)))
                  {
                     ota_size = 0;      // Failed
                     ESP_LOGI (TAG, "Failed to start flash");
                  }
               }
               ota_progress = 0;
               ota_data = 0;
               next = now + 5;
            }
            break;
         case 0xD:             // Data
            if (ota_size && (*data.data & 0xF) == ((ota_ack + 1) & 0xF))
            {                   // Expected data
               ota_ack = 0xA0 + (*data.data & 0xF);
               if (REVK_ERR_CHECK (esp_ota_write_with_offset (ota_handle, data.data + 1, data.size - 1, ota_data)))
               {
                  ota_size = 0;
                  ESP_LOGE (TAG, "Flash failed at %d", ota_data);
               }
               ota_data += data.size - 1;
               int percent = ota_data * 100 / ota_size;
               if (percent != ota_progress && (percent == 100 || next < now || percent / 10 != ota_progress / 10))
               {
                  ESP_LOGI (TAG, "Flash %d%%", percent);
                  jo_t j = jo_make (NULL);
                  jo_int (j, "size", ota_size);
                  jo_int (j, "loaded", ota_data);
                  jo_int (j, "progress", ota_progress = percent);
                  revk_info_clients ("upgrade", &j, -1);
                  next = now + 5;
               }
            }                   // else ESP_LOGI(TAG, "Unexpected %02X not %02X+1", *data.data, ota_ack);
            send_ack ();
            break;
         case 0xE:             // End - not checking sequence
            if (ota_size)
            {
               if (ota_data != ota_size)
                  ESP_LOGE (TAG, "Flash missing data %d/%d", ota_data, ota_size);
               else if (ota_partition && !REVK_ERR_CHECK (esp_ota_end (ota_handle)))
               {
                  jo_t j = jo_make (NULL);
                  jo_int (j, "size", ota_size);
                  jo_string (j, "complete", ota_partition->label);
                  revk_info_clients ("upgrade", &j, -1);        // Send from target device so cloud knows target is upgraded
                  esp_ota_set_boot_partition (ota_partition);
                  revk_restart ("OTA", 3);
               }
               ota_partition = NULL;
               ota_size = 0;
               ota_ack = 0xA0 + (*data.data & 0xF);
            }
            send_ack ();
            break;
         case 0xA:             // Ack
            if (esp_mesh_is_root () && !memcmp (&mesh_ota_addr, &from, sizeof (mesh_ota_addr)) && mesh_ota_ack
                && mesh_ota_ack == *data.data)
            {
               mesh_ota_ack = 0;
               xSemaphoreGive (mesh_ota_sem);
            }                   // else ESP_LOGI(TAG, "Extra ack %02X", *data.data);
            break;
         }
      } else if (data.proto == MESH_PROTO_MQTT)
      {
         if (mesh_decode (&from, &data))
            continue;
         char *e = (char *) data.data + data.size;
         char *topic = (char *) data.data;
         uint8_t tag = *topic++;
         char *payload = topic;
         while (payload < e && *payload)
            payload++;
         if (payload == e)
            continue;           // We expect topic ending in NULL
         payload++;             // Clear the null
         if (esp_mesh_is_root ())
         {                      // To root: tag is client bit map of which external MQTT server to send to
            if (memcmp (from.addr, revk_mac, 6))
            {                   // From us is exception, we would have sent direct
               for (int client = 0; client < MQTT_CLIENTS; client++)
                  if (tag & (1 << client))
                     lwmqtt_send_full (mqtt_client[client], -1, topic, e - payload, (void *) payload, tag >> 7);        // Out
            }
         } else
         {                      // To leaf: tag is client ID
            ESP_LOGD (TAG, "Mesh Rx MQTT%02X %s: %s %.*s", tag, mac, topic, (int) (e - payload), payload);
            mqtt_rx ((void *) (int) tag, topic, e - payload, (void *) payload); // In
         }
      } else if (data.proto == MESH_PROTO_JSON)
      {                         // Internal message
         if (mesh_decode (&from, &data))
            continue;
         ESP_LOGD (TAG, "Mesh Rx JSON %s: %.*s", mac, data.size, (char *) data.data);
         jo_t j = jo_parse_mem (data.data, data.size + 1);      // Include the null
         if (app_callback)
            app_callback (0, "mesh", mac, NULL, j);
         jo_free (&j);
      }
   }
   vTaskDelete (NULL);
}
#endif

