revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#if defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
static void
dhcpc_stop (void)
{
   esp_netif_ip_info_t ip_info;
   if (!esp_netif_get_old_ip_info (sta_netif, &ip_info))
      esp_netif_dhcpc_stop (sta_netif); // Crashes is no old IP, work around
}
#endif

#if defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
static void
setup_ip (void)
{                               // Set up DHCPC / fixed IP
   void dns (const char *ip, esp_netif_dns_type_t type)
   {
      if (!ip || !*ip)
         return;
      char *i = strdup (ip);
      char *c = strrchr (i, '/');
      if (c)
         *c = 0;
      esp_netif_dns_info_t dns = { };
      if (!esp_netif_str_to_ip4 (i, &dns.ip.u_addr.ip4))
         dns.ip.type = AF_INET;
#ifdef	CONFIG_LWIP_IPV6
      else if (!esp_netif_str_to_ip6 (i, &dns.ip.u_addr.ip6))
         dns.ip.type = AF_INET6;
#endif
      else
      {
         ESP_LOGE (TAG, "Bad DNS IP %s", i);
         return;
      }
      if (esp_netif_set_dns_info (sta_netif, type, &dns))
         ESP_LOGE (TAG, "Bad DNS %s", i);
      else
         ESP_LOGI (TAG, "Set DNS IP %s", i);
      freez (i);
   }
   if (*wifiip)
   {
      dhcpc_stop ();
      esp_netif_ip_info_t info = { 0, };
      makeip (&info, wifiip, wifigw);
      REVK_ERR_CHECK (esp_netif_set_ip_info (sta_netif, &info));
      ESP_LOGI (TAG, "Fixed IP %s GW %s", wifiip, wifigw);
      if (!*wifidns[0])
         dns (wifiip, ESP_NETIF_DNS_MAIN);      /* Fallback to using gateway for DNS */
      link_down = 0;            // Static so not GOT_IP
   } else
   {
      if (!link_down)
         link_down = uptime (); // Just in case we think we have a link, we don't yet - need GOT_IP
      ESP_LOGI (TAG, "Dynamic IP start");
      esp_netif_dhcpc_start (sta_netif);        /* Dynamic IP */
   }
   dns (wifidns[0], ESP_NETIF_DNS_MAIN);
   dns (wifidns[1], ESP_NETIF_DNS_BACKUP);
   dns (wifidns[2], ESP_NETIF_DNS_FALLBACK);
#ifndef	CONFIG_REVK_MESH
#ifdef  CONFIG_REVK_MQTT
   if (*wifiip)
      revk_mqtt_init ();        // Won't start on GOT_IP so start here
#endif
#endif
}
#endif

#ifdef	CONFIG_REVK_MESH
static void
stop_ip (void)
{
   dhcpc_stop ();
}
#endif

#if defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
static void
sta_init (void)
{
   REVK_ERR_CHECK (esp_event_loop_create_default ());
   wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT ();
   REVK_ERR_CHECK (esp_wifi_init (&cfg));
   REVK_ERR_CHECK (esp_wifi_set_storage (WIFI_STORAGE_RAM));
#ifdef  CONFIG_NIMBLE_ENABLED
   REVK_ERR_CHECK (esp_wifi_set_ps (wifips ? wifimaxps ? WIFI_PS_MAX_MODEM : WIFI_PS_MIN_MODEM : WIFI_PS_MIN_MODEM));
#else
   REVK_ERR_CHECK (esp_wifi_set_ps (wifips ? wifimaxps ? WIFI_PS_MAX_MODEM : WIFI_PS_MIN_MODEM : WIFI_PS_NONE));
#endif
   sta_netif = esp_netif_create_default_wifi_sta ();
   ap_netif = esp_netif_create_default_wifi_ap ();
   REVK_ERR_CHECK (esp_event_handler_register (IP_EVENT, ESP_EVENT_ANY_ID, &ip_event_handler, NULL));
   REVK_ERR_CHECK (esp_event_handler_register (WIFI_EVENT, ESP_EVENT_ANY_ID, &ip_event_handler, NULL));
}
#endif

#ifdef	CONFIG_REVK_WIFI
static void
wifi_sta_config (void)
{
   const char *ssid = wifissid;
   ESP_LOGI (TAG, "WiFi STA [%s]", ssid);
   wifi_config_t cfg = { 0, };
   if (wifibssid[0] || wifibssid[1] || wifibssid[2])
   {
      memcpy (cfg.sta.bssid, wifibssid, sizeof (cfg.sta.bssid));
      cfg.sta.bssid_set = 1;
   }
   cfg.sta.channel = wifichan;
   cfg.sta.scan_method = ((esp_reset_reason () == ESP_RST_DEEPSLEEP) ? WIFI_FAST_SCAN : WIFI_ALL_CHANNEL_SCAN);
   strncpy ((char *) cfg.sta.ssid, ssid, sizeof (cfg.sta.ssid));
   strncpy ((char *) cfg.sta.password, wifipass, sizeof (cfg.sta.password));
#ifndef CONFIG_IDF_TARGET_ESP8266
   REVK_ERR_CHECK (esp_wifi_set_protocol
                   (ESP_IF_WIFI_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR));
#endif
   REVK_ERR_CHECK (esp_wifi_set_config (ESP_IF_WIFI_STA, &cfg));
}
#endif

#ifdef	CONFIG_REVK_WIFI
static void
wifi_init (void)
{
   if (!sta_netif)
      sta_init ();
   else
      REVK_ERR_CHECK (esp_wifi_stop ());
   // Mode
   esp_wifi_set_mode (*apssid ? WIFI_MODE_APSTA : WIFI_MODE_STA);
   // Client
   wifi_sta_config ();
   // Doing AP mode after STA mode - seems to fail is not
   if (*apssid)
   {                            // AP config
      wifi_config_t cfg = { 0, };
      cfg.ap.channel = wifichan;
      int l;
      if ((l = strlen (apssid)) > sizeof (cfg.ap.ssid))
         l = sizeof (cfg.ap.ssid);
      cfg.ap.ssid_len = l;
      memcpy (cfg.ap.ssid, apssid, cfg.ap.ssid_len = l);
      if (*appass)
      {
         if ((l = strlen (appass)) > sizeof (cfg.ap.password))
            l = sizeof (cfg.ap.password);
         memcpy (&cfg.ap.password, appass, l);
         cfg.ap.authmode = WIFI_AUTH_WPA_WPA2_PSK;
      }
      cfg.ap.ssid_hidden = aphide;
      cfg.ap.max_connection = apmax;
      esp_netif_ip_info_t info = { 0, };
      makeip (&info, *apip ? apip : "10.0.0.1/24", NULL);
      REVK_ERR_CHECK (esp_wifi_set_protocol
                      (ESP_IF_WIFI_AP, aplr ? WIFI_PROTOCOL_LR : (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)));
      REVK_ERR_CHECK (esp_netif_dhcps_stop (ap_netif));
      REVK_ERR_CHECK (esp_netif_set_ip_info (ap_netif, &info));
      REVK_ERR_CHECK (esp_netif_dhcps_start (ap_netif));
      REVK_ERR_CHECK (esp_wifi_set_config (ESP_IF_WIFI_AP, &cfg));
      ESP_LOGI (TAG, "WIFiAP [%s]%s%s", apssid, aphide ? " (hidden)" : "", aplr ? " (LR)" : "");
   }
   setup_ip ();
   REVK_ERR_CHECK (esp_wifi_start ());
   if (*wifissid)
      REVK_ERR_CHECK (esp_wifi_connect ());
}
#endif

#ifdef	CONFIG_REVK_MESH
static void
mesh_init (void)
{
   // https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/network/esp_mesh.html
   if (!sta_netif)
   {
      dhcpc_stop ();
      esp_wifi_disconnect ();   // Just in case
      esp_wifi_stop ();
      sta_init ();
      REVK_ERR_CHECK (esp_netif_dhcps_stop (ap_netif));
      if (meshlr)
      {                         // Set up LR mode
         REVK_ERR_CHECK (esp_wifi_set_mode (WIFI_MODE_APSTA));
         REVK_ERR_CHECK (esp_wifi_set_protocol
                         (ESP_IF_WIFI_AP, meshlr ? WIFI_PROTOCOL_LR : (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)));
         REVK_ERR_CHECK (esp_wifi_set_protocol
                         (ESP_IF_WIFI_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR));
      }
      REVK_ERR_CHECK (esp_mesh_set_max_layer (meshdepth));
      REVK_ERR_CHECK (esp_mesh_set_xon_qsize (16));
      esp_wifi_set_mode (WIFI_MODE_NULL);       // Set by mesh
      REVK_ERR_CHECK (esp_wifi_start ());
      REVK_ERR_CHECK (esp_mesh_init ());
      REVK_ERR_CHECK (esp_mesh_disable_ps ());
      REVK_ERR_CHECK (esp_mesh_allow_root_conflicts (0));
      REVK_ERR_CHECK (esp_mesh_send_block_time (1000)); // Note sure if needed or what but a second it a long time - send calls should check return code
      REVK_ERR_CHECK (esp_event_handler_register (MESH_EVENT, ESP_EVENT_ANY_ID, &ip_event_handler, NULL));
      mesh_cfg_t cfg = MESH_INIT_CONFIG_DEFAULT ();
      memcpy ((uint8_t *) & cfg.mesh_id, meshid, 6);
      if (wifibssid[0] || wifibssid[1] || wifibssid[2])
      {
         memcpy (cfg.router.bssid, wifibssid, sizeof (cfg.router.bssid));
         cfg.router.allow_router_switch = 1;    // Fallback if not found
      }
      cfg.channel = wifichan;
      cfg.allow_channel_switch = 1;     // Fallback
      int l;
      if ((l = strlen (wifissid)) > sizeof (cfg.router.ssid))
         l = sizeof (cfg.router.ssid);
      cfg.router.ssid_len = l;
      memcpy (cfg.router.ssid, wifissid, cfg.router.ssid_len = l);
      if (*wifipass)
      {
         if ((l = strlen (wifipass)) > sizeof (cfg.router.password))
            l = sizeof (cfg.router.password);
         memcpy (&cfg.router.password, wifipass, l);
      }
      cfg.mesh_ap.max_connection = meshwidth;
      if (meshmax && meshmax < meshwidth)
         cfg.mesh_ap.max_connection = meshmax;
      if (*meshpass)
      {
         if ((l = strlen (meshpass)) > sizeof (cfg.mesh_ap.password))
            l = sizeof (cfg.mesh_ap.password);
         memcpy (&cfg.mesh_ap.password, meshpass, l);
      }
      REVK_ERR_CHECK (esp_mesh_set_config (&cfg));
      if (meshmax)
         REVK_ERR_CHECK (esp_mesh_set_capacity_num (meshmax + 10));     // Adding a few is to try and make mesh set up more stable when switching modes, etc, experimental
      REVK_ERR_CHECK (esp_mesh_disable_ps ());
      if (meshmax == 1 || meshroot)
         esp_mesh_set_type (MESH_ROOT); // We are forcing root
      revk_task ("mesh", mesh_task, NULL, 3);
   }
   REVK_ERR_CHECK (esp_mesh_start ());
}
#endif

