revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_MESH
void
revk_send_unsub (int client, const mac_t mac)
{
   if (client >= MQTT_CLIENTS || !mqtt_client[client])
      return;
   char id[13];
   sprintf (id, "%02X%02X%02X%02X%02X%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
   ESP_LOGI (TAG, "MQTT%d Unsubscribe %s", client, id);
   void sub (const char *prefix)
   {
      char *topic = NULL;
      const char *an = appname,
         *sl = "/";
      if (!prefixapp)
         an = sl = "";
      if (asprintf (&topic, "%s%s%s/%s/#", prefix, sl, an, id) < 0)
         return;
      lwmqtt_unsubscribe (mqtt_client[client], topic);
      freez (topic);
      if (asprintf (&topic, "%s%s%s/*/#", prefix, sl, an) < 0)
         return;
      lwmqtt_unsubscribe (mqtt_client[client], topic);
      freez (topic);
      if (*hostname && strcmp (hostname, id))
      {
         if (asprintf (&topic, "%s%s%s/%s/#", prefix, sl, an, hostname) < 0)
            return;
         lwmqtt_unsubscribe (mqtt_client[client], topic);
         freez (topic);
      }
   }
   sub (prefixcommand);
   if (!client)
      sub (prefixsetting);
}
#endif

#ifdef	CONFIG_REVK_MQTT
void
revk_send_sub (int client, const mac_t mac)
{
   if (client >= MQTT_CLIENTS || !mqtt_client[client])
      return;
   char id[13];
   sprintf (id, "%02X%02X%02X%02X%02X%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
   ESP_LOGI (TAG, "MQTT%d Subscribe %s", client, id);
   void sub (const char *prefix)
   {
      char *topic = NULL;
      const char *an = appname,
         *sl = "/";
      if (!prefixapp)
         an = sl = "";
      if (asprintf (&topic, "%s%s%s/%s/#", prefix, sl, an, id) < 0)
         return;
      lwmqtt_subscribe (mqtt_client[client], topic);
      freez (topic);
      if (asprintf (&topic, "%s%s%s/%s/#", prefix, sl, an, prefixapp ? "*" : appname) < 0)
         return;
      lwmqtt_subscribe (mqtt_client[client], topic);
      freez (topic);
      if (*hostname && strcmp (hostname, id))
      {
         if (asprintf (&topic, "%s%s%s/%s/#", prefix, sl, an, hostname) < 0)
            return;
         lwmqtt_subscribe (mqtt_client[client], topic);
         freez (topic);
      }
   }
   sub (prefixcommand);
   if (!client)
      sub (prefixsetting);
}
#endif

#ifdef	CONFIG_REVK_MQTT
static void
mqtt_rx (void *arg, char *topic, unsigned short plen, unsigned char *payload)
{                               // Expects to be able to write over topic
   int client = (int) arg;
   if (client < 0 || client >= MQTT_CLIENTS)
      return;
   if (topic)
   {
      const char *err = NULL;
      // Break up topic
      char *prefix = topic;
      char *target = NULL;
      char *suffix = NULL;
      char *apppart = NULL;
      char *p = topic;
      while (*p && *p != '/')
         p++;
      if (prefixapp && *p)
      {                         // Expect app name next
         int l = strlen (appname);
         if (!strncmp (p + 1, appname, l) && (!p[1 + l] || p[1 + l] == '/'))
         {                      // App name present
            apppart = ++p;
            while (*p && *p != '/')
               p++;
         }
      }
      if (*p)
      {
         target = ++p;
         while (*p && *p != '/')
            p++;
      }
      if (*p)
         suffix = ++p;
#ifdef	CONFIG_REVK_MESH
      if (esp_mesh_is_root () && target && ((prefixapp && *target == '*') || strncmp (target, revk_id, strlen (revk_id))))
      {                         // pass on to clients as global or not for us
         mesh_data_t data = {.proto = MESH_PROTO_MQTT };
         mesh_make_mqtt (&data, client, -1, topic, plen, payload);      // Ensures MESH_PAD space one end
         mesh_addr_t addr = {.addr = {255, 255, 255, 255, 255, 255}
         };
         if (prefixapp && *target != '*')
            for (int n = 0; n < sizeof (addr.addr); n++)
               addr.addr[n] =
                  (((target[n * 2] & 0xF) + (target[n * 2] > '9' ? 9 : 0)) << 4) + ((target[1 + n * 2] & 0xF) +
                                                                                    (target[1 + n * 2] > '9' ? 9 : 0));
         mesh_encode_send (&addr, &data, MESH_DATA_P2P);        // **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
         freez (data.data);
      }
#endif
      // Break up topic
      if (apppart)
         apppart[-1] = 0;
      if (target)
         target[-1] = 0;
      else
         target = "?";
      if (suffix)
         suffix[-1] = 0;
      jo_t j = NULL;
      if (plen)
      {
         if (*payload != '"' && *payload != '{' && *payload != '[')
         {                      // Looks like non JSON
            if (prefix && suffix && !strcmp (prefix, prefixsetting))
            {                   // Special case for settings, the suffix is the setting
               j = jo_object_alloc ();
               jo_stringf (j, suffix, "%.*s", plen, payload);
               suffix = NULL;
            } else
            {                   // Just JSON the argument
               j = jo_create_alloc ();
               int q = 0;
               if ((plen == 4 && !memcmp (payload, "true", plen)) || (plen == 5 && !memcmp (payload, "false", plen)))
                  q += plen;    // Boolean
               else
               {                // Check for int
                  if (q + 1 < plen && payload[q] == '-' && payload[q + 1] >= '0' && payload[q + 1] <= '9')
                     q++;
                  while (q < plen && payload[q] >= '0' && payload[q] <= '9')
                     q++;
                  if (q + 1 < plen && payload[q] == '.' && payload[q + 1] >= '0' && payload[q + 1] <= '9')
                  {
                     q++;
                     while (q < plen && payload[q] >= '0' && payload[q] <= '9')
                        q++;
                     // Meh, exponents?
                  }
               }
               if (plen && q == plen)
                  jo_litf (j, NULL, "%.*s", plen, payload);     // Looks safe as number
               else
                  jo_stringf (j, NULL, "%.*s", plen, payload);
            }
         } else
         {                      // Parse JSON argument
            j = jo_parse_mem (payload, plen + 1);       // +1 as we can trust a trailing NULL from lwmqtt
            jo_skip (j);        // Check whole JSON
            int pos;
            err = jo_error (j, &pos);
            if (err)
               ESP_LOGE (TAG, "Fail at pos %d, %s: (%.10s...) %.*s", pos, err, jo_debug (j), plen, payload);
         }
         jo_rewind (j);
      }
      if (!strcmp (target, prefixapp ? "*" : appname) || !strcmp (target, revk_id) || (*hostname && !strcmp (target, hostname)))
         target = NULL;         // Mark as us for simple testing by app_command, etc
      if (!client && prefix && !strcmp (prefix, prefixcommand) && suffix && !strcmp (suffix, "upgrade"))
         err = (err ? : revk_upgrade (target, j));      // Special case as command can be to other host
      else if (!client && !target)
      {                         // For us (could otherwise be for app callback)
         if (prefix && !strcmp (prefix, prefixcommand))
            err = (err ? : revk_command (suffix, j));
         else if (prefix && !strcmp (prefix, prefixsetting))
         {
            if (!suffix && !plen)
            {
               setting_dump_requested = 1;
               err = "";
            } else if (suffix)
               err = "";        // Not sensible, we have been addressed (suffix is used as JSON if present with no JSON), clash prefixapp and not
            else
               err = ((err ? : revk_setting (j)) ? : "Unknown setting");
         } else
            err = (err ? : ""); // Ignore
      }
      if ((!err || !*err) && app_callback)
      {                         /* Pass to app, even if we handled with no error */
         jo_rewind (j);
         const char *e2 = app_callback (client, prefix, target, suffix, j);
         if (e2 && (*e2 || !err))
            err = e2;           /* Overwrite error if we did not have one */
      }
      if (!err && !target)
         err = "Unknown";
      if (err && *err)
      {
         jo_t e = jo_make (NULL);
         jo_string (e, "description", err);
         if (prefix)
            jo_string (e, "prefix", prefix);
         if (target)
            jo_string (e, "target", target);
         if (suffix)
            jo_string (e, "suffix", suffix);
         if (j)
            jo_lit (e, "payload", (char *) payload);
         else if (plen)
            jo_string (e, "payload", (char *) payload);
         revk_error (suffix, &e);
      }
      jo_free (&j);
   } else if (payload)
   {
      ESP_LOGI (TAG, "MQTT%d connected %s", client, (char *) payload);
      xEventGroupSetBits (revk_group, (GROUP_MQTT << client));
      xEventGroupClearBits (revk_group, (GROUP_MQTT_DOWN << client));
      revk_send_sub (client, revk_mac); // Self
      up_next = 0;
      if (app_callback)
      {
         jo_t j = jo_create_alloc ();
         jo_string (j, NULL, (char *) payload);
         jo_rewind (j);
         app_callback (client, prefixcommand, NULL, "connect", j);
         jo_free (&j);
      }
      revk_restart ("Online", -1);      // Cancel restart
   } else
   {
      if (xEventGroupGetBits (revk_group) & (GROUP_MQTT << client))
      {
         xEventGroupSetBits (revk_group, (GROUP_MQTT_DOWN << client));
         xEventGroupClearBits (revk_group, (GROUP_MQTT << client));
         ESP_LOGI (TAG, "MQTT%d disconnected", client);
         if (app_callback)
            app_callback (client, prefixcommand, NULL, "disconnect", NULL);
         // Can we flush TCP TLS stuff somehow?
      } else
      {
         ESP_LOGI (TAG, "MQTT%d failed", client);
         if (esp_get_free_heap_size () < 60000 && mqttcert[client]->len)        // Messy - pick up TLS memory leak
            revk_restart ("Memory issue (TLS)", 10);
      }
   }
}
#endif

