revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_MQTT
void
revk_mqtt_init (void)
{
   for (int client = 0; client < MQTT_CLIENTS; client++)
      if (*mqtthost[client] && !mqtt_client[client])
      {
         xEventGroupSetBits (revk_group, (GROUP_MQTT_DOWN << client));
         lwmqtt_client_config_t config = {
            .arg = (void *) client,
            .hostname = mqtthost[client],
            .retain = 1,
            .payload = (void *) "{\"up\":false}",
            .plen = -1,
            .keepalive = 30,
            .callback = &mqtt_rx,
         };
         const char *an = appname,
            *sl = "/";
         if (!prefixapp)
            an = sl = "";
         if (asprintf ((void *) &config.topic, "%s%s%s/%s", prefixstate, sl, an, hostname) < 0)
            return;
         if (asprintf ((void *) &config.client, "%s-%s", appname, revk_id) < 0)
         {
            freez (config.topic);
            return;
         }
         ESP_LOGI (TAG, "MQTT%d %s", client, config.hostname);
         if (mqttcert[client]->len)
         {
            config.ca_cert_ref = 1;     // No need to duplicate
            config.ca_cert_buf = (void *) mqttcert[client]->data;
            config.ca_cert_bytes = mqttcert[client]->len;
         }
#ifdef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
         else if (mqttport[client] == 8883)
            config.crt_bundle_attach = esp_crt_bundle_attach;
#endif
         if (clientkey->len && clientcert->len)
         {
            config.client_cert_ref = 1; // No need to duplicate
            config.client_cert_buf = (void *) clientcert->data;
            config.client_cert_bytes = clientcert->len;
            config.client_key_ref = 1;  // No need to duplicate
            config.client_key_buf = (void *) clientkey->data;
            config.client_key_bytes = clientkey->len;
         }
         if (*mqttuser[client])
            config.username = mqttuser[client];
         if (*mqttpass[client])
            config.password = mqttpass[client];
         config.port = mqttport[client];
         mqtt_client[client] = lwmqtt_client (&config);
         freez (config.topic);
         freez (config.client);
      }
}
#endif

static void
ip_event_handler (void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
   if (event_base == WIFI_EVENT)
   {
      switch (event_id)
      {
#ifdef	CONFIG_REVK_WIFI
      case WIFI_EVENT_AP_START:
         ESP_LOGI (TAG, "AP Start");
         if (app_callback)
         {
            jo_t j = jo_create_alloc ();
            jo_string (j, "ssid", apssid);
            jo_rewind (j);
            app_callback (0, prefixcommand, NULL, "ap", j);
            jo_free (&j);
         }
         break;
      case WIFI_EVENT_STA_START:
         ESP_LOGI (TAG, "STA Start");
#ifdef CONFIG_IDF_TARGET_ESP8266
         // Fails with ESP_ERR_WIFI_IF on esp8266 if called where it was
         // originally placed. I've looked this up in examples.
         REVK_ERR_CHECK (esp_wifi_set_protocol (ESP_IF_WIFI_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N));
#endif
         break;
      case WIFI_EVENT_STA_STOP:
         ESP_LOGI (TAG, "STA Stop");
         xEventGroupClearBits (revk_group, GROUP_WIFI | GROUP_IP);
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         break;
      case WIFI_EVENT_STA_CONNECTED:
         ESP_LOGI (TAG, "STA Connected");
         xEventGroupSetBits (revk_group, GROUP_WIFI);
         xEventGroupClearBits (revk_group, GROUP_OFFLINE);
#ifdef	CONFIG_LWIP_IPV6
         esp_netif_create_ip6_linklocal (sta_netif);
#endif
         break;
      case WIFI_EVENT_STA_DISCONNECTED:
         ESP_LOGI (TAG, "STA Disconnect");
         xEventGroupClearBits (revk_group, GROUP_WIFI | GROUP_IP);
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         esp_wifi_connect ();
         break;
      case WIFI_EVENT_AP_STOP:
         ESP_LOGI (TAG, "AP Stop");
         break;
      case WIFI_EVENT_AP_STACONNECTED:
         ESP_LOGI (TAG, "AP STA Connect");
         break;
      case WIFI_EVENT_AP_STADISCONNECTED:
         ESP_LOGI (TAG, "AP STA Disconnect");
         break;
      case WIFI_EVENT_AP_PROBEREQRECVED:
         ESP_LOGE (TAG, "AP PROBEREQRECVED");
         break;
#else
#ifdef	CONFIG_REVK_MESH
      case WIFI_EVENT_STA_DISCONNECTED:
         if (!link_down)
            link_down = uptime ();
         break;
#endif
#endif
      default:
         // On ESP32 uint32_t, returned by this func, appears to be long, while on ESP8266 it's a pure unsigned int
         // The easiest and least ugly way to get around is to cast to long explicitly
         ESP_LOGI (TAG, "WiFi event %ld", (long) event_id);
         break;
      }
   }
   if (event_base == IP_EVENT)
   {
      switch (event_id)
      {
      case IP_EVENT_STA_LOST_IP:
         if (!link_down)
            link_down = uptime ();      // Applies for non mesh, and mesh
         ESP_LOGI (TAG, "Lost IP");
         break;
      case IP_EVENT_STA_GOT_IP:
         {
            link_down = 0;      // Applies for non mesh, and mesh
            ip_event_got_ip_t *event = (ip_event_got_ip_t *) event_data;
            wifi_ap_record_t ap = { };
            REVK_ERR_CHECK (esp_wifi_sta_get_ap_info (&ap));
            ESP_LOGI (TAG, "Got IP " IPSTR " from %s", IP2STR (&event->ip_info.ip), (char *) ap.ssid);
            xEventGroupSetBits (revk_group, GROUP_IP);
            sntp_stop ();
            sntp_init ();
#ifdef	CONFIG_REVK_MQTT
            revk_mqtt_init ();
#endif
#ifdef  CONFIG_REVK_WIFI
            xEventGroupSetBits (revk_group, GROUP_WIFI);
            if (app_callback)
            {
               jo_t j = jo_object_alloc ();
               jo_string (j, "ssid", (char *) ap.ssid);
               if (ap.phy_lr)
                  jo_bool (j, "lr", 1);
               jo_stringf (j, "ip", IPSTR, IP2STR (&event->ip_info.ip));
               jo_stringf (j, "gw", IPSTR, IP2STR (&event->ip_info.gw));
               jo_rewind (j);
               app_callback (0, prefixcommand, NULL, "wifi", j);
               jo_free (&j);
            }
#endif
#ifdef	CONFIG_REVK_APMODE
            apstoptime = uptime () + 10;        // Stop ap mode soon
#endif
         }
         break;
      case IP_EVENT_GOT_IP6:
         ESP_LOGI (TAG, "Got IPv6");
         break;
      default:
         ESP_LOGI (TAG, "IP event %ld", (long) event_id);
         break;
      }
   }
#ifdef	CONFIG_REVK_MESH
   if (event_base == MESH_EVENT)
   {
      ESP_LOGI (TAG, "Mesh event %ld", (long) event_id);
      switch (event_id)
      {
      case MESH_EVENT_STOPPED:
         ESP_LOGD (TAG, "STA Stop");
         xEventGroupClearBits (revk_group, GROUP_WIFI | GROUP_IP);
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         revk_mqtt_close ("Mesh gone");
         break;
      case MESH_EVENT_PARENT_CONNECTED:
         {
            if (esp_mesh_is_root ())
            {
               ESP_LOGI (TAG, "Mesh root");
               setup_ip ();     // Handles starting dhcp or setting link_down
               revk_mqtt_init ();
            } else
            {
               ESP_LOGI (TAG, "Mesh child");
               stop_ip ();
               revk_mqtt_close ("No child of mesh");
               if (link_down)
               {
                  ESP_LOGI (TAG, "Link up");
                  link_down = 0;        // As child we assume parent has a link
               }
            }
         }
         break;
      case MESH_EVENT_PARENT_DISCONNECTED:
      case MESH_EVENT_NO_PARENT_FOUND:
         if (!link_down)
         {
            link_down = uptime ();
            ESP_LOGD (TAG, "Link down");
         }
         if (mesh_root_known)
         {
            ESP_LOGI (TAG, "Mesh root lost");
            mesh_root_known = 0;
         }
         stop_ip ();
         revk_mqtt_close ("Mesh gone");
         break;
      case MESH_EVENT_ROOT_ADDRESS:    // We know the root
         if (!mesh_root_known)
         {
            ESP_LOGI (TAG, "Mesh root known");
            mesh_root_known = 1;
         }
         break;
#if 0
      case MESH_EVENT_TODS_STATE:
         {
            mesh_event_toDS_state_t *toDs_state = (mesh_event_toDS_state_t *) event_data;
            ESP_LOGI (TAG, "TODS %d", *toDs_state);
            mesh_root_known = 1;
         }
         break;
#endif
      }
   }
#endif
}

static const char *
blink_default (const char *user)
{                               // What blinking to do - NULL means do default, "" means off if none of the default special cases apply, otherwise the requested colour sequence, unless restarting (white)
   if (restart_time)
      return "W";               // Rebooting - override user even
   if (user && *user)
      return user;
   if (!*wifissid)
      return "RW";              // No wifi SSID
#ifdef  CONFIG_REVK_APMODE
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode == WIFI_MODE_APSTA)
      return "BW";              // AP+sta mode
   if (mode == WIFI_MODE_AP)
      return "CW";              // AP mode only
   if (mode == WIFI_MODE_NULL)
      return "MW";              // Off?
#endif
   if (!(xEventGroupGetBits (revk_group) & GROUP_WIFI))
      return "MW";              // No WiFi
   if (revk_link_down ())
      return "YW";              // Link down
   if (user)
      return "K";
   return "RYGCBM";             // Idle
}

static void
task (void *pvParameters)
{                               /* Main RevK task */
   if (watchdogtime)
      compat_task_wdt_add ();
   pvParameters = pvParameters;
   /* Log if unexpected restart */
   int64_t tick = 0;
   uint32_t ota_check = 0;
   if (otaauto)
      ota_check = 3600 + (esp_random () % 3600);        // Check at start anyway, but allow an hour anyway
   while (1)
   {                            /* Idle */
      {                         // Fast (once per 100ms)
         int64_t now = esp_timer_get_time ();
         if (now < tick)
         {                      /* wait for next 10th, so idle task runs */
            usleep (tick - now);
            now = tick;
         }
         tick += 100000ULL;     /* 10th second */
         if (!wdt_test && watchdogtime)
            esp_task_wdt_reset ();
         if (blink[0])
         {                      // LED blinking
            static uint8_t lit = 0,
               count = 0;
            if (count)
               count--;
            else
            {
               uint8_t on = blink_on,
                  off = blink_off;
#if     defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MQTT)
               if (!on && !off)
                  on = off = (revk_link_down ()? 3 : 6);
#endif
               lit = 1 - lit;
               count = (lit ? on : off);
               if (!count)
               {                // Only once, allows for on or off to be 0, if both 0 we do nothing!
                  lit = 1 - lit;
                  count = (lit ? on : off);
               }
               if (count)
               {
                  if (blink[1])
                  {             // Coloured LED
                     static const char *c = "",
                        *last = NULL;
                     const char *base = blink_default (blink_colours);
                     if (base != last)
                        c = last = base;        // Restart sequence if changed
                     if (!*c)
                        c = base;
                     char col = 0;
                     if (lit)
                        col = *c++;     // Sequences the colours set for the on state
                     gpio_set_level (blink[0] & 0x3F, (col == 'R' || col == 'Y' || col == 'M' || col == 'W') ^ ((blink[0] & 0x40) ? 1 : 0));    // Red LED
                     gpio_set_level (blink[1] & 0x3F, (col == 'G' || col == 'Y' || col == 'C' || col == 'W') ^ ((blink[1] & 0x40) ? 1 : 0));    // Green LED
                     gpio_set_level (blink[2] & 0x3F, (col == 'B' || col == 'C' || col == 'M' || col == 'W') ^ ((blink[2] & 0x40) ? 1 : 0));    // Blue LED
                  } else
                     gpio_set_level (blink[0] & 0x3F, lit ^ ((blink[0] & 0x40) ? 1 : 0));       // Single LED
               }
            }
         }
         if (setting_dump_requested)
         {                      // Done here so not reporting from MQTT
            setting_dump_requested = 0;
            revk_setting_dump ();
         }
      }
      static uint32_t last = 0;
      uint32_t now = uptime ();
      if (now != last)
      {                         // Slow (once a second)
         last = now;
         if (ota_check && ota_check < now)
         {                      // Check for s/w update
            time_t t = time (0);
            struct tm tm = { 0 };
            localtime_r (&t, &tm);
            if (now > 7200 && tm.tm_hour >= 6)
               ota_check = now + (esp_random () % 21600);       // A periodic check should be in the middle of the night, so wait a bit more (<7200 is startup check)
            else
            {                   // Do a check
               ota_check = now + 86400 * otaauto - 43200 + (esp_random () % 86400);     // Next check approx otaauto days later
#ifdef CONFIG_REVK_MESH
               if (esp_mesh_is_root ())
#endif
                  revk_upgrade (NULL, NULL);    // Checks for upgrade
            }
         }
#ifdef CONFIG_REVK_MESH
         ESP_LOGI (TAG, "Up %ld, Link down %ld, Mesh nodes %d%s", (long) now, revk_link_down (), esp_mesh_get_total_node_num (),
                   esp_mesh_is_root ()? " (root)" : mesh_root_known ? " (leaf)" : " (no-root)");
#else
#ifdef	CONFIG_REVK_WIFI
         ESP_LOGI (TAG, "Up %ld, Link down %ld", (long) now, (long) revk_link_down ());
#else
         ESP_LOGI (TAG, "Up %ld", (long) now);
#endif
#endif
#ifdef	CONFIG_REVK_MQTT
         {                      // Report even if not on-line as mesh works anyway
            static uint8_t lastch = 0;
            static mac_t lastbssid;
            static uint32_t lastheap = 0;
            uint32_t heap = esp_get_free_heap_size ();
            wifi_ap_record_t ap = {
            };
            esp_wifi_sta_get_ap_info (&ap);
            if (lastch != ap.primary || memcmp (lastbssid, ap.bssid, 6) || heap / 10000 < lastheap / 10000 || now > up_next
                || restart_time)
            {
               if (restart_time && ota_task_id)
                  restart_time++;       // wait
               jo_t j = jo_make (NULL);
               jo_string (j, "id", revk_id);
               if (!restart_time || restart_time > now
#ifdef 	CONFIG_REVK_MESH
                   + (esp_mesh_is_root ()? 0 : 2)       // Reports the up:false sooner if a leaf node, as takes time to send...
#endif
                  )
                  jo_int (j, "up", now);
               else
                  jo_bool (j, "up", 0);
               if (restart_time)
               {
                  if (restart_time > now)
                     jo_int (j, "restart", restart_time - now);
                  jo_string (j, "reason", restart_reason);
               }
               if (!up_next)
               {                // some unchanging stuff
#ifdef	CONFIG_SECURE_BOOT
                  jo_bool (j, "secureboot", 1);
#endif
#ifdef	CONFIG_NVS_ENCRYPTION
                  jo_bool (j, "nvsecryption", 1);
#endif
                  jo_string (j, "app", appname);
                  jo_string (j, "version", revk_version);
                  jo_string (j, "build-suffix", revk_build_suffix);
                  {             // Stupid format Jul 10 2021
                     char temp[20];
                     if (revk_build_date (temp))
                        jo_string (j, "build", temp);
                  }
                  {
                     uint32_t size_flash_chip;
                     esp_flash_get_size (NULL, &size_flash_chip);
                     jo_int (j, "flash", size_flash_chip);
                  }
                  jo_int (j, "rst", esp_reset_reason ());
               }
               if (!up_next || heap / 10000 < lastheap / 10000)
                  jo_int (j, "mem", esp_get_free_heap_size ());
               if (!up_next || lastch != ap.primary || memcmp (lastbssid, ap.bssid, 6))
               {                // Wifi
                  jo_string (j, "ssid", (char *) ap.ssid);
                  jo_stringf (j, "bssid", "%02X%02X%02X%02X%02X%02X", (uint8_t) ap.bssid[0], (uint8_t) ap.bssid[1],
                              (uint8_t) ap.bssid[2], (uint8_t) ap.bssid[3], (uint8_t) ap.bssid[4], (uint8_t) ap.bssid[5]);
                  jo_int (j, "rssi", ap.rssi);
                  jo_int (j, "chan", ap.primary);
                  if (ap.phy_lr)
                     jo_bool (j, "lr", 1);
                  {
                     esp_netif_ip_info_t ip;
                     if (!esp_netif_get_ip_info (sta_netif, &ip) && ip.ip.addr)
                        jo_stringf (j, "ipv4", IPSTR, IP2STR (&ip.ip));
                  }
#ifdef CONFIG_LWIP_IPV6
                  {
                     esp_ip6_addr_t ip;
                     if (!esp_netif_get_ip6_global (sta_netif, &ip))
                        jo_stringf (j, "ipv6", IPV6STR, IPV62STR (ip));
                  }
#endif
               }
               revk_state_clients (NULL, &j, -1);       // up message goes to all servers
               lastheap = heap;
               lastch = ap.primary;
               memcpy (lastbssid, ap.bssid, 6);
               up_next = now + 3600;
            }
         }
#endif
#ifdef  CONFIG_REVK_MESH
         if (esp_mesh_is_root ())
         {                      // Root reset is if wifireset and alone, or mesh reset even if not alone
            if ((wifireset && revk_link_down () > wifireset && esp_mesh_get_total_node_num () <= 1)
                || (meshreset && revk_link_down () > meshreset))
               revk_restart ("Mesh sucks", 0);
         } else
         {                      // Leaf reset if only if link down (meaning alone)
            if (wifireset && revk_link_down () > wifireset)
               revk_restart ("Mesh sucks", 0);
         }
#endif
#ifdef	CONFIG_REVK_WIFI
         if (wifireset && revk_link_down () > wifireset)
            revk_restart ("Offline too long", 0);
#endif
#ifdef	CONFIG_REVK_APMODE
         if (apgpio && (gpio_get_level (apgpio & 0x3F) ^ (apgpio & 0x40 ? 1 : 0)))
         {
            ap_start ();
            if (aptime)
               apstoptime = now + aptime;
         }
#if     defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MQTT)
         if (apwait && revk_link_down () > apwait)
            ap_start ();
#endif
#ifdef	CONFIG_REVK_WIFI
         if (!*wifissid)
            ap_start ();
#endif
         if (apstoptime && apstoptime < now)
            ap_stop ();
#endif
         if (nvs_time && nvs_time < now)
         {
            REVK_ERR_CHECK (nvs_commit (nvs));
            nvs_time = 0;
         }
         if (restart_time && restart_time < now)
         {                      /* Restart */
            if (!restart_reason)
               restart_reason = "Unknown";
            ESP_LOGI (TAG, "Restart %s", restart_reason);
            if (app_callback)
            {
               jo_t j = jo_create_alloc ();
               jo_string (j, NULL, restart_reason);
               jo_rewind (j);
               app_callback (0, prefixcommand, NULL, "shutdown", j);
               jo_free (&j);
            }
            revk_mqtt_close (restart_reason);
#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
            revk_wifi_close ();
#endif
            REVK_ERR_CHECK (nvs_commit (nvs));
            esp_restart ();
            restart_time = 0;
         }
      }
   }
}

/* External functions */
void
revk_boot (app_callback_t * app_callback_cb)
{                               /* Start the revk task, use __FILE__ and __DATE__ and __TIME__ to set task name and version ID */
#ifdef	CONFIG_REVK_MESH
   esp_wifi_disconnect ();      // Just in case
   mesh_mutex = xSemaphoreCreateBinary ();
   xSemaphoreGive (mesh_mutex);
   mesh_ota_sem = xSemaphoreCreateBinary ();    // Leave in taken, only given on ack received
#endif

