revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_PARTITION_CHECK
   {                            // Only if we are in the first OTA partition, else changes could be problematic
      const esp_partition_t *ota_partition = esp_ota_get_running_partition ();
      ESP_LOGI (TAG, "Running from %s at %lX (size %lu)", ota_partition->label, ota_partition->address, ota_partition->size);
      const char *table = CONFIG_PARTITION_TABLE_FILENAME;
      uint32_t size;
      esp_flash_get_size (NULL, &size);
      uint32_t secsize = 4096;  /* TODO */
      int expect = 4;
      if (strstr (table, "8m"))
         expect = 8;
      else if (strstr (table, "16m"))
         expect = 16;
      if (size == expect * 1024 * 1024)
      {
#ifdef  BUILD_ESP32_USING_CMAKE
         extern const uint8_t part_start[] asm ("_binary_partition_table_bin_start");
         extern const uint8_t part_end[] asm ("_binary_partition_table_bin_start");
#else
#error Use cmake
#endif
         /* Check and update partition table - expects some code to stay where it can run, i.e.0x10000, but may clear all settings */
         if ((part_end - part_start) > secsize)
            ESP_LOGE (TAG, "Block size error (%ld>%ld)", (long) (part_end - part_start), (long) secsize);
         else
         {
            uint8_t *mem = malloc (secsize);
            if (!mem)
               ESP_LOGE (TAG, "Malloc fail: %ld", (long) secsize);
            else
            {
               REVK_ERR_CHECK (esp_flash_read (NULL, mem, CONFIG_PARTITION_TABLE_OFFSET, secsize));
               if (memcmp (mem, part_start, part_end - part_start))
               {
                  if (strchr (ota_partition->label, '0'))
                  {
#ifndef CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED
#error Set CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED to allow CONFIG_REVK_PARTITION_CHECK
#endif
                     ESP_LOGI (TAG, "Updating partition table at %X", CONFIG_PARTITION_TABLE_OFFSET);
                     memset (mem, 0, secsize);
                     memcpy (mem, part_start, part_end - part_start);
                     REVK_ERR_CHECK (esp_flash_erase_region (NULL, CONFIG_PARTITION_TABLE_OFFSET, secsize));
                     REVK_ERR_CHECK (esp_flash_write (NULL, mem, CONFIG_PARTITION_TABLE_OFFSET, secsize));
                     esp_restart ();
                  } else
                     ESP_LOGE (TAG, "Not updating partition as not on ota 0 (%s)", ota_partition->label);
               } else
               {
                  ESP_LOGI (TAG, "Partition table at %X as expected (%s)", CONFIG_PARTITION_TABLE_OFFSET, table);
                  //ESP_LOG_BUFFER_HEX_LEVEL(TAG, mem, secsize, ESP_LOG_INFO);
               }
               freez (mem);
            }
         }
      } else
         ESP_LOGE (TAG, "Flash partition not updated, size is unexpected: %ld (%s)", (long) size, table);
   }
#endif
   ESP_LOGI (TAG, "nvs_flash_init");
   nvs_flash_init ();
   ESP_LOGI (TAG, "nvs_flash_init_partition");
   nvs_flash_init_partition (TAG);
   ESP_LOGI (TAG, "nvs_open_from_partition");
   const esp_app_desc_t *app = esp_app_get_description ();
   if (nvs_open_from_partition (TAG, TAG, NVS_READWRITE, &nvs))
      REVK_ERR_CHECK (nvs_open (TAG, NVS_READWRITE, &nvs));
   revk_register ("client", 0, 0, &clientkey, NULL, SETTING_SECRET);    // Parent
   revk_register ("prefix", 0, 0, &prefixcommand, "command", SETTING_SECRET);   // Parent
   /* Fallback if no dedicated partition */
#define str(x) #x
#define s(n,d)		revk_register(#n,0,0,&n,d,0)
#define sp(n,d)		revk_register(#n,0,0,&n,d,SETTING_SECRET)
#define sa(n,a,d)	revk_register(#n,a,0,&n,d,0)
#define sap(n,a,d)	revk_register(#n,a,0,&n,d,SETTING_SECRET)
#define fh(n,a,s,d)	revk_register(#n,a,s,&n,d,SETTING_BINDATA|SETTING_HEX)
#define	u32(n,d)	revk_register(#n,0,4,&n,str(d),0)
#define	u16(n,d)	revk_register(#n,0,2,&n,str(d),0)
#define	u16a(n,a,d)	revk_register(#n,a,2,&n,str(d),0)
#define	i16(n)		revk_register(#n,0,2,&n,0,SETTING_SIGNED)
#define	u8a(n,a,d)	revk_register(#n,a,1,&n,str(d),0)
#define	u8(n,d)		revk_register(#n,0,1,&n,str(d),0)
#define	b(n,d)		revk_register(#n,0,1,&n,str(d),SETTING_BOOLEAN)
#define	s8(n,d)		revk_register(#n,0,1,&n,str(d),SETTING_SIGNED)
#define io(n,d)		revk_register(#n,0,sizeof(n),&n,"- "str(d),SETTING_SET|SETTING_BITFIELD|SETTING_FIX)
#define ioa(n,a,d)	revk_register(#n,a,sizeof(*n),&n,"- "str(d),SETTING_SET|SETTING_BITFIELD|SETTING_FIX)
#define p(n)		revk_register("prefix"#n,0,0,&prefix##n,#n,0)
#define h(n,l,d)	revk_register(#n,0,l,&n,d,SETTING_BINDATA|SETTING_HEX)
#define hs(n,l,d)	revk_register(#n,0,l,&n,d,SETTING_BINDATA|SETTING_HEX|SETTING_SECRET)
#define bd(n,d)		revk_register(#n,0,0,&n,d,SETTING_BINDATA)
#define bad(n,a,d)	revk_register(#n,a,0,&n,d,SETTING_BINDATA)
#define bdp(n,d)	revk_register(#n,0,0,&n,d,SETTING_BINDATA|SETTING_SECRET)
   settings;
#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
   revk_register ("wifi", 0, 0, &wifissid, CONFIG_REVK_WIFISSID, SETTING_SECRET);       // Parent
   wifisettings;
#ifdef	CONFIG_REVK_MESH
   revk_register ("mesh", 0, 6, &meshid, CONFIG_REVK_MESHID, SETTING_BINDATA | SETTING_HEX | SETTING_SECRET);   // Parent
   meshsettings;
#else
#ifdef	CONFIG_REVK_WIFI
   revk_register ("ap", 0, 0, &apssid, CONFIG_REVK_APSSID, SETTING_SECRET);     // Parent
   apsettings;
#endif
#endif
#endif
#ifdef	CONFIG_REVK_MQTT
   revk_register ("mqtt", MQTT_CLIENTS, 0, &mqtthost, CONFIG_REVK_MQTTHOST, SETTING_SECRET);    // Parent
   mqttsettings;
#endif
#ifdef	CONFIG_REVK_APMODE
   apconfigsettings;
#endif
#undef s
#undef sa
#undef fh
#undef u32
#undef u16
#undef i16
#undef u8a
#undef u8
#undef b
#undef s8
#undef io
#undef ioa
#undef p
#undef str
#undef h
#undef hs
#undef bd
#undef bad
#undef bdp
   if (watchdogtime)
   {                            /* Watchdog */
      compat_task_wdt_reconfigure (true, watchdogtime * 1000, true);
   }
   REVK_ERR_CHECK (nvs_open (app->project_name, NVS_READWRITE, &nvs));
   /* Application specific settings */
   if (!*appname)
      appname = strdup (app->project_name);
   /* Default is from build */
   for (int b = 0; b < sizeof (blink) / sizeof (*blink); b++)
      if (blink[b])
      {
         uint8_t p = blink[b] & 0x3F;
#ifdef	CONFIG_REVK_PICO
         if (p == 6 || (p >= 9 && p <= 11))
#else
         if ((p >= 6 && p <= 11) || p == 20)
#endif
         {
            ESP_LOGE (TAG, "Not using GPIO %d", p);
            blink[b] = 0;
            continue;
         }
         gpio_reset_pin (p);
         gpio_set_level (p, (blink[b] & 0x40) ? 0 : 1); /* on */
         gpio_set_direction (p, GPIO_MODE_OUTPUT);      /* Blinking LED */
      }
#ifdef	CONFIG_REVK_APMODE
   if (apgpio)
   {
      uint8_t p = apgpio & 0x3F;
#ifdef	CONFIG_REVK_PICO
      if (p == 6 || (p >= 9 && p <= 11))
#else
      if ((p >= 6 && p <= 11) || p == 20)
#endif
      {
         ESP_LOGE (TAG, "Not using GPIO %d", p);
         apgpio = 0;
      }
      if (apgpio)
      {
         gpio_reset_pin (p);
         gpio_set_direction (p, GPIO_MODE_INPUT);       /* AP mode button */
      }
   }
#endif
   restart_time = 0;
   /* If settings change at start up we can ignore. */
   esp_netif_init ();
#ifndef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
   REVK_ERR_CHECK (esp_tls_set_global_ca_store (LECert, sizeof (LECert)));
#endif
   revk_version = app->version;
   revk_app = appname;
   char *d = strstr (revk_version, "-dirty");
   if (d)
      asprintf ((char **) &revk_version, "%.*s+", d - revk_version, app->version);
   sntp_setoperatingmode (SNTP_OPMODE_POLL);
   setenv ("TZ", tz, 1);
   tzset ();
   sntp_setservername (0, ntphost);
   app_callback = app_callback_cb;
   {                            /* Chip ID from MAC */
      REVK_ERR_CHECK (esp_efuse_mac_get_default (revk_mac));
#ifdef	CONFIG_REVK_SHORT_ID
      revk_binid =
         ((revk_mac[0] << 16) + (revk_mac[1] << 8) + revk_mac[2]) ^ ((revk_mac[3] << 16) + (revk_mac[4] << 8) + revk_mac[5]);
      snprintf (revk_id, sizeof (revk_id), "%06llX", revk_binid);
#else
      revk_binid =
         ((uint64_t) revk_mac[0] << 40) + ((uint64_t) revk_mac[1] << 32) + ((uint64_t) revk_mac[2] << 24) +
         ((uint64_t) revk_mac[3] << 16) + ((uint64_t) revk_mac[4] << 8) + ((uint64_t) revk_mac[5]);
      snprintf (revk_id, sizeof (revk_id), "%012llX", revk_binid);
#endif
      if (!hostname || !*hostname)
         hostname = revk_id;    // default hostname
   }
   revk_group = xEventGroupCreate ();
   xEventGroupSetBits (revk_group, GROUP_OFFLINE);
}

void
revk_start (void)
{                               // Start stuff, init all done
#ifdef	CONFIG_REVK_WIFI
   wifi_init ();
#endif
#ifdef	CONFIG_REVK_MESH
   mesh_init ();
#endif
   /* DHCP */
   char *id = NULL;
#ifdef	CONFIG_REVK_PREFIXAPP
   asprintf (&id, "%s-%s", appname, hostname);
#else
   asprintf (&id, "%s", hostname);
#endif
   esp_netif_set_hostname (sta_netif, id);
   freez (id);
#ifdef  CONFIG_MDNS_MAX_INTERFACES
   REVK_ERR_CHECK (mdns_init ());
   mdns_hostname_set (hostname);
   mdns_instance_name_set (appname);
#endif
   revk_task (TAG, task, NULL, 3);
}

TaskHandle_t
revk_task (const char *tag, TaskFunction_t t, const void *param, int kstack)
{                               /* General user task make */
   if (!kstack)
      kstack = 8;               // Default 8k
   TaskHandle_t task_id = NULL;
#ifdef	CONFIG_FREERTOS_UNICORE
   xTaskCreate (t, tag, kstack * 1024, (void *) param, 2, &task_id);    // Only one code anyway and not CPU1
#else
#ifdef REVK_LOCK_CPU1
   xTaskCreatePinnedToCore (t, tag, kstack * 1024, (void *) param, 2, &task_id, 1);
#else
   xTaskCreate (t, tag, kstack * 1024, (void *) param, 2, &task_id);
#endif
#endif
   if (!task_id)
      ESP_LOGE (TAG, "Task %s failed", tag);
   return task_id;
}

