revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_MESH
void
mesh_make_mqtt (mesh_data_t * data, uint8_t tag, int tlen, const char *topic, int plen, const unsigned char *payload)
{
   // Tag is typically bit map of clients with bit 7 for retain when sending to root, and is client number when sending to leaf
   memset (data, 0, sizeof (*data));
   data->proto = MESH_PROTO_MQTT;
   if (plen < 0)
      plen = strlen ((char *) payload);
   if (tlen < 0)
      tlen = strlen (topic);
   data->size = 1 + tlen + 1 + plen;
   data->data = malloc (data->size + MESH_PAD);
   char *p = (char *) data->data;
   *p++ = tag;
   memcpy (p, topic, tlen);
   p += tlen;
   *p++ = 0;
   if (plen)
      memcpy (p, payload, plen);
   p += plen;
   ESP_LOGD (TAG, "Mesh Tx MQTT%02X %.*s %.*s", tag, tlen, topic, plen, payload);
}
#endif

#ifdef	CONFIG_REVK_MESH
void
revk_mesh_send_json (const mac_t mac, jo_t * jp)
{
   if (!jp)
      return;
   jo_t j = jo_pad (jp, MESH_PAD);      // Ensures MESH_PAD on end of JSON
   if (!j)
   {
      ESP_LOGE (TAG, "JO Pad failed");
      return;
   }
   const char *json = jo_rewind (j);
   if (json)
   {
      if (mac)
         ESP_LOGD (TAG, "Mesh Tx JSON %02X%02X%02X%02X%02X%02X: %s", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], json);
      else
         ESP_LOGD (TAG, "Mesh Tx JSON to root node: %s", json);
      mesh_data_t data = {.proto = MESH_PROTO_JSON,.data = (void *) json,.size = strlen (json) };
      mesh_encode_send ((void *) mac, &data, MESH_DATA_P2P);    // **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
   }
   jo_free (jp);
}
#endif

#ifdef	CONFIG_REVK_MQTT
const char *
revk_mqtt_out (uint8_t clients, int tlen, const char *topic, int plen, const unsigned char *payload, char retain)
{
   if (!clients)
      return NULL;
   if (link_down)
      return "Link down";
#ifdef	CONFIG_REVK_MESH
   if (esp_mesh_is_device_active () && !esp_mesh_is_root ())
   {                            // Send via mesh
      mesh_data_t data = {.proto = MESH_PROTO_MQTT };
      mesh_make_mqtt (&data, clients | (retain << 7), tlen, topic, plen, payload);      // Ensures MESH_PAD space one end
      mesh_encode_send (NULL, &data, 0);        // **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
      freez (data.data);
      return NULL;
   }
#endif
   const char *er = NULL;
   for (int client = 0; client < MQTT_CLIENTS && !er; client++)
      if (clients & (1 << client))
         er = lwmqtt_send_full (mqtt_client[client], tlen, topic, plen, payload, retain);
   return er;
}
#endif

const char *
revk_mqtt_send_raw (const char *topic, int retain, const char *payload, uint8_t clients)
{
#ifdef	CONFIG_REVK_MQTT
   ESP_LOGD (TAG, "MQTT%02X publish %s (%s)", clients, topic ? : "-", payload);
   return revk_mqtt_out (clients, -1, topic, -1, (void *) payload, retain);
#else
   return "No MQTT";
#endif
}

const char *
revk_mqtt_send_str_clients (const char *str, int retain, uint8_t clients)
{
#ifdef	CONFIG_REVK_MQTT
   const char *e = str;
   while (*e && *e != ' ')
      e++;
   const char *p = e;
   if (*p)
      p++;
   ESP_LOGD (TAG, "MQTT%02X publish %.*s (%s)", clients, e - str, str, p);
   return revk_mqtt_out (clients, e - str, str, -1, (void *) p, retain);
#else
   return "No MQTT";
#endif
}

const char *
revk_mqtt_send_payload_clients (const char *prefix, int retain, const char *suffix, const char *payload, uint8_t clients)
{                               // Send to main, and N additional MQTT servers, or only to extra server N if copy -ve
#ifdef	CONFIG_REVK_MQTT
   const char *an = appname,
      *sl = "/";
   if (!prefixapp)
      an = sl = "";
   char *topic = NULL;
   if (!prefix)
      topic = (char *) suffix;  /* Set fixed topic */
   else if (asprintf (&topic, suffix ? "%s%s%s/%s/%s" : "%s%s%s/%s", prefix, sl, an, hostname, suffix) < 0)
      topic = NULL;
   if (!topic)
      return "No topic";
   const char *er = revk_mqtt_send_raw (topic, retain, payload, clients);
   if (topic != suffix)
      freez (topic);
   return er;
#else
   return "No MQTT";
#endif
}

const char *
revk_mqtt_send_clients (const char *prefix, int retain, const char *suffix, jo_t * jp, uint8_t clients)
{
   if (!jp)
      return "No payload JSON";
   int pos = 0;
   const char *err = jo_error (*jp, &pos);
   if (err)
   {
      jo_free (jp);
      ESP_LOGE (TAG, "JSON error sending %s/%s (%s) at %d", prefix ? : "", suffix ? : "", err, pos);
   } else if (jo_isalloc (*jp))
   {
      char *payload = jo_finisha (jp);
      if (payload)
         err = revk_mqtt_send_payload_clients (prefix, retain, suffix, payload, clients);
      freez (payload);
   } else
   {                            // Static
      char *payload = jo_finish (jp);
      if (payload)
         err = revk_mqtt_send_payload_clients (prefix, retain, suffix, payload, clients);
   }
   return err;
}

const char *
revk_state_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // State message (retained)
   return revk_mqtt_send_clients (prefixstate, 1, suffix, jp, clients);
}

const char *
revk_event_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // Event message (may one day create log entries)
   return revk_mqtt_send_clients (prefixevent, 0, suffix, jp, clients);
}

const char *
revk_error_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // Error message, waits a while for connection if possible before sending
   xEventGroupWaitBits (revk_group,
#ifdef	CONFIG_REVK_WIFI
                        GROUP_WIFI |
#endif
                        GROUP_MQTT, false, true, 20000 / portTICK_PERIOD_MS);
   return revk_mqtt_send_clients (prefixerror, 0, suffix, jp, clients);
}

const char *
revk_info_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // Info message, nothing special
   return revk_mqtt_send_clients (prefixinfo, 0, suffix, jp, clients);
}

const char *
revk_restart (const char *reason, int delay)
{                               /* Restart cleanly */
#ifdef	CONFIG_REVK_MESH
   if (delay >= 2 && !esp_mesh_is_root ())
      delay -= 2;               // For when lots of devices done at once, do root later
#endif
   if (restart_reason != reason && delay >= 0)
      ESP_LOGI (TAG, "Restart %d %s", delay, reason);
   restart_reason = reason;
   if (delay < 0)
      restart_time = 0;         /* Cancelled */
   else
   {
      if (delay || !restart_time)
         restart_time = uptime () + delay;
      if (app_callback)
      {
         jo_t j = jo_create_alloc ();
         jo_string (j, NULL, reason);
         jo_rewind (j);
         app_callback (0, prefixcommand, NULL, "restart", j);
         jo_free (&j);
      }
   }
   return "";                   /* Done */
}

#ifdef	CONFIG_REVK_APMODE
esp_err_t
revk_web_config_start (httpd_handle_t webserver)
{
#ifdef	CONFIG_REVK_APDNS
   {
      httpd_uri_t uri = {
         .uri = "/hotspot-detect.html",
         .method = HTTP_GET,
         .handler = revk_web_config,
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
#endif
#ifdef	CONFIG_HTTPD_WS_SUPPORT
   {
      httpd_uri_t uri = {
         .uri = "/wifilist",
         .method = HTTP_GET,
         .handler = revk_web_wifilist,
         .is_websocket = true,
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
#endif
#ifdef  CONFIG_MDNS_MAX_INTERFACES
   mdns_service_add (NULL, "_http", "_tcp", 80, NULL, 0);
#endif
   return 0;
}
#endif

#ifdef	CONFIG_REVK_APMODE
esp_err_t
revk_web_config_stop (httpd_handle_t webserver)
{
#ifdef	CONFIG_REVK_APDNS
   REVK_ERR_CHECK (httpd_unregister_uri_handler (webserver, "/hotspot-detect.html", HTTP_GET));
#endif
#ifdef	CONFIG_HTTPD_WS_SUPPORT
   REVK_ERR_CHECK (httpd_unregister_uri_handler (webserver, "/wifilist", HTTP_GET));
#endif
   return 0;
}
#endif

#ifdef	CONFIG_REVK_APMODE
esp_err_t
revk_web_config (httpd_req_t * req)
{
   void head (void)
   {
      httpd_resp_set_type (req, "text/html;charset=utf-8");
      httpd_resp_sendstr_chunk (req, "<meta name='viewport' content='width=device-width, initial-scale=1'>");
      httpd_resp_sendstr_chunk (req, "<html><body style='font-family:sans-serif;background:#8cf;'><h1>");
      httpd_resp_sendstr_chunk (req, hostname);
      httpd_resp_sendstr_chunk (req, "</h1>");
   }
   esp_err_t foot (void)
   {
      httpd_resp_sendstr_chunk (req, "<hr><address>");
      httpd_resp_sendstr_chunk (req, appname);
      httpd_resp_sendstr_chunk (req, ": ");
      httpd_resp_sendstr_chunk (req, revk_version);
      httpd_resp_sendstr_chunk (req, " ");
      char temp[20];
      httpd_resp_sendstr_chunk (req, revk_build_date (temp) ? : "?");
      httpd_resp_sendstr_chunk (req, "</address></body></html>");
      httpd_resp_sendstr_chunk (req, NULL);
      return ESP_OK;
   }
#ifndef  CONFIG_HTTPD_WS_SUPPORT
   if (httpd_req_get_url_query_len (req))
   {
      char query[200];
      if (!httpd_req_get_url_query_str (req, query, sizeof (query)))
      {
         head ();
         httpd_resp_sendstr_chunk (req, "<p>");
         jo_t j = jo_parse_query (query);
         if (jo_find (j, "upgrade"))
         {
            const char *e = revk_command ("upgrade", NULL);
            if (e && *e)
               httpd_resp_sendstr_chunk (req, e);
            else
               httpd_resp_sendstr_chunk (req, "Upgrade started");
         } else
         {
            const char *e = revk_setting (j) ? : "Settings saved";
            if (e && *e)
            {
               httpd_resp_sendstr_chunk (req, e);
               httpd_resp_sendstr_chunk (req, " @ ");
               httpd_resp_sendstr_chunk (req, jo_debug (j));
            } else
               httpd_resp_sendstr_chunk (req, "Settings saved");
         }
         jo_free (&j);
         httpd_resp_sendstr_chunk (req, "</p>");
         httpd_resp_sendstr_chunk (req, "<p><a href=\"/\">Go to main page</a></p><p><a href=\"/wifi\">Back to settings</a></p>");
         return foot ();
      }
   }
#endif
   head ();
   if (!revk_link_down () && *otahost)
   {
      httpd_resp_sendstr_chunk (req, "<form");
#ifdef  CONFIG_HTTPD_WS_SUPPORT
      httpd_resp_sendstr_chunk (req, " action='/' onsubmit=\"ws.send(JSON.stringify({'upgrade':true}));\"");
#endif
      httpd_resp_sendstr_chunk (req, "><input name=\"upgrade\" type=submit value=\"Upgrade\"> from <i>");
      httpd_resp_sendstr_chunk (req, otahost);
      httpd_resp_sendstr_chunk (req, "</i></form>");
   }
   httpd_resp_sendstr_chunk (req, "<form name=WIFI");
#ifdef  CONFIG_HTTPD_WS_SUPPORT
   httpd_resp_sendstr_chunk (req,
                             " onsubmit=\"o={};for(f of document.WIFI.elements){if(f.name){o[f.name]=f.value;}};ws.send(JSON.stringify(o));return false;\"");
#endif
   httpd_resp_sendstr_chunk (req, "><table>");
   httpd_resp_sendstr_chunk (req, "<tr><td>Hostname</td><td><input name=hostname");
   if (!*hostname)
      httpd_resp_sendstr_chunk (req, " autofocus");
   httpd_resp_sendstr_chunk (req, " value='");
   if (hostname != revk_id)
      httpd_resp_sendstr_chunk (req, hostname);
   httpd_resp_sendstr_chunk (req, "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off' placeholder='");
   httpd_resp_sendstr_chunk (req, revk_id);
   httpd_resp_sendstr_chunk (req, "'>");
#ifdef  CONFIG_MDNS_MAX_INTERFACES
   httpd_resp_sendstr_chunk (req, ".local");
#endif
   httpd_resp_sendstr_chunk (req, "</td></tr><tr><td colspan=2><hr></td></tr>");
   httpd_resp_sendstr_chunk (req, "<tr><td>SSID</td><td><input name=wifissid");
   if (*hostname)
      httpd_resp_sendstr_chunk (req, " autofocus");
   httpd_resp_sendstr_chunk (req, " maxlength=32 placeholder='WiFI name' value='");
   if (*wifissid)
      httpd_resp_sendstr_chunk (req, wifissid);
   httpd_resp_sendstr_chunk (req, "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off'></td></tr>");
   httpd_resp_sendstr_chunk (req,
                             "<tr><td>Passphrase</td><td><input name=wifipass placeholder='passphrase' type=password maxlength=32 value='");
   if (*wifipass)
      httpd_resp_sendstr_chunk (req, wifipass); // Not a valid password as too short, used to indicate one is set
   httpd_resp_sendstr_chunk (req,
                             "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off'></td></tr><tr><td colspan=2><hr></td></tr><tr><td>MQTT host</td><td><input maxlength=128 placeholder='hostname' name=mqtthost value='");
   if (*mqtthost[0])
      httpd_resp_sendstr_chunk (req, mqtthost[0]);
   httpd_resp_sendstr_chunk (req, "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off'>");
   if (mqtt_client[0])
      httpd_resp_sendstr_chunk (req, lwmqtt_connected (mqtt_client[0]) ? "✓" : lwmqtt_failed (mqtt_client[0]) ? "✘" : "…");       // MQTT status
   httpd_resp_sendstr_chunk (req,
                             "</td></tr><tr><td>MQTT user</td><td><input maxlength=32 placeholder='username' name=mqttuser value='");
   if (*mqttuser[0])
      httpd_resp_sendstr_chunk (req, mqttuser[0]);
   httpd_resp_sendstr_chunk (req,
                             "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off'></td></tr><tr><td>MQTT pass</td><td><input maxlength=32 placeholder='password' name=mqttpass value='");
   if (*mqttpass[0])
      httpd_resp_sendstr_chunk (req, mqttpass[0]);
   httpd_resp_sendstr_chunk (req,
                             "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off'></td></tr><tr><td colspan=2><hr></td></tr><tr><td>Timezone</td><td><input maxlength=128 name=tz value='");
   if (*tz)
      httpd_resp_sendstr_chunk (req, tz);
   httpd_resp_sendstr_chunk (req,
                             "' autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off'> See <a href='https://gist.github.com/alwynallan/24d96091655391107939'>list</a></td></tr>");
   httpd_resp_sendstr_chunk (req, "</table><input id=set type=submit value=Set>&nbsp;<b id=msg></b></form>");
   httpd_resp_sendstr_chunk (req, "<div id=list></div>");
#ifdef CONFIG_HTTPD_WS_SUPPORT
   httpd_resp_sendstr_chunk (req, "<script>"    //
                             "var f=document.WIFI;"     //
                             "var ws = new WebSocket('ws://'+window.location.host+'/wifilist');"        //
                             "ws.onclose=function(e){ws=undefined;document.getElementById('set').style.visibility='hidden';};"  //
                             "ws.onerror=function(e){ws.close();};"     //
                             "ws.onmessage=function(e){"        //
                             "o=JSON.parse(e.data);"    //
                             "if(typeof o === 'string')document.getElementById('msg').textContent=o;"   //
                             "else if(o.ip)document.getElementById('msg').innerHTML='Rebooting <a href=\"http://'+o.ip+'/\">'+o.ip+'</a>';"     //
                             "else if(typeof o === 'object')o.forEach(function(s){"     //
                             "b=document.createElement('button');"      //
                             "b.onclick=function(e){"   //
                             "f.wifissid.value=s;"      //
                             "f.wifipass.value='';"     //
                             "f.wifipass.focus();"      //
                             "return false;"    //
                             "};"       //
                             "b.textContent=s;" //
                             "document.getElementById('list').appendChild(b);"  //
                             "});"      //
                             "};"       //
                             "</script>");
#endif
   httpd_resp_sendstr_chunk (req, "<p><a href='/'>Home</a></p>");
   if (otaauto && *otahost)
   {
      httpd_resp_sendstr_chunk (req, "<p>Note, automatic upgrade from <i>");
      httpd_resp_sendstr_chunk (req, otahost);
      httpd_resp_sendstr_chunk (req, "</i> is enabled. See instructions to make changes.</p>");
   }
   {                            // IP info
      httpd_resp_sendstr_chunk (req, "<table>");
      char temp[100];
      {
         time_t now = time (0);
         if (now > 1000000000)
         {
            struct tm t;
            localtime_r (&now, &t);
            strftime (temp, sizeof (temp), "<tr><td>Time</td><td>%F %T %Z</td></tr>", &t);
            httpd_resp_sendstr_chunk (req, temp);
         }
      }
      {
         esp_netif_ip_info_t ip;
         if (!esp_netif_get_ip_info (sta_netif, &ip) && ip.ip.addr)
         {
            sprintf (temp, "<tr><td>IPv4</td><td>" IPSTR "</td></tr>", IP2STR (&ip.ip));
            httpd_resp_sendstr_chunk (req, temp);
            sprintf (temp, "<tr><td>Gateway</td><td>" IPSTR "</td></tr>", IP2STR (&ip.gw));
            httpd_resp_sendstr_chunk (req, temp);
         }
      }
#ifdef CONFIG_LWIP_IPV6
      {
         esp_ip6_addr_t ip;
         if (!esp_netif_get_ip6_global (sta_netif, &ip))
         {
            sprintf (temp, "<tr><td>IPv6</td><td>" IPV6STR "</td></tr>", IPV62STR (ip));
            httpd_resp_sendstr_chunk (req, temp);
         }
      }
#endif
      httpd_resp_sendstr_chunk (req, "</table>");
   }

   return foot ();
}
#endif

#ifdef	CONFIG_REVK_APMODE
#ifdef	CONFIG_HTTPD_WS_SUPPORT
esp_err_t
revk_web_wifilist (httpd_req_t * req)
{
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   int fd = httpd_req_to_sockfd (req);
   void wsend (jo_t * jp)
   {
      char *js = jo_finisha (jp);
      if (js)
      {
         httpd_ws_frame_t ws_pkt;
         memset (&ws_pkt, 0, sizeof (httpd_ws_frame_t));
         ws_pkt.payload = (uint8_t *) js;
         ws_pkt.len = strlen (js);
         ws_pkt.type = HTTPD_WS_TYPE_TEXT;
         httpd_ws_send_frame_async (req->handle, fd, &ws_pkt);
         free (js);
      }
   }
   void msg (const char *msg)
   {
      jo_t j = jo_create_alloc ();
      jo_string (j, NULL, msg);
      wsend (&j);
   }
   esp_err_t scan (void)
   {
      if (mode == WIFI_MODE_NULL)
         esp_wifi_set_mode (WIFI_MODE_STA);
      else if (mode == WIFI_MODE_AP)
         esp_wifi_set_mode (WIFI_MODE_APSTA);
      msg ("Scanning");
      jo_t j = jo_create_alloc ();
      jo_array (j, NULL);
      if (esp_wifi_scan_start (NULL, true) == ESP_ERR_WIFI_STATE)
      {
         esp_wifi_disconnect ();
         esp_wifi_scan_start (NULL, true);
      }
      uint16_t ap_count = 0;
      static wifi_ap_record_t ap_info[32];      // Messy being static - should really have mutex
      memset (ap_info, 0, sizeof (ap_info));
      uint16_t number = sizeof (ap_info) / sizeof (*ap_info);
      REVK_ERR_CHECK (esp_wifi_scan_get_ap_records (&number, ap_info));
      REVK_ERR_CHECK (esp_wifi_scan_get_ap_num (&ap_count));
      int found = 0;
      for (int i = 0; (i < number) && (i < ap_count); i++)
      {
         int q;
         for (q = 0; q < i && strcmp ((char *) ap_info[i].ssid, (char *) ap_info[q].ssid); q++);
         if (q < i)
            continue;           // Duplicate
         jo_string (j, NULL, (char *) ap_info[i].ssid);
         found++;
      }
      wsend (&j);
      msg (found ? "" : "No WiFI found");
      esp_wifi_set_mode (mode);
      return ESP_OK;
   }
   if (req->method == HTTP_GET)
      return scan ();
   // Send something - new wifi creds
   httpd_ws_frame_t ws_pkt;
   uint8_t *buf = NULL;
   memset (&ws_pkt, 0, sizeof (httpd_ws_frame_t));
   ws_pkt.type = HTTPD_WS_TYPE_TEXT;
   esp_err_t ret = httpd_ws_recv_frame (req, &ws_pkt, 0);
   if (ret)
      return ret;
   if (!ws_pkt.len)
      return scan ();
   buf = calloc (1, ws_pkt.len + 1);
   if (!buf)
      return ESP_ERR_NO_MEM;
   ws_pkt.payload = buf;
   ret = httpd_ws_recv_frame (req, &ws_pkt, ws_pkt.len);
   if (!ret)
   {
      jo_t j = jo_parse_mem (buf, ws_pkt.len);
      if (j)
      {
         if (jo_here (j) == JO_OBJECT)
         {
            uint8_t upgrade = jo_find (j, "upgrade");
            int ok = 0;
            if (!revk_link_down ())
            {                   // Already connected as sta...
               if (!upgrade)
               {
                  msg ("Storing new settings");
                  ok = 1;
               }
            } else if (jo_find (j, "wifissid") == JO_STRING)
            {                   // Try connect
               char ssid[33] = "";
               char pass[33] = "";
               jo_strncpy (j, ssid, sizeof (ssid));
               if (jo_find (j, "wifipass") == JO_STRING)
                  jo_strncpy (j, pass, sizeof (pass));
               msg ("Connecting");
               esp_wifi_set_mode (mode == WIFI_MODE_NULL ? WIFI_MODE_STA : WIFI_MODE_APSTA);
               wifi_config_t cfg = { 0, };
               cfg.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
               strncpy ((char *) cfg.sta.ssid, ssid, sizeof (cfg.sta.ssid));
               strncpy ((char *) cfg.sta.password, pass, sizeof (cfg.sta.password));
               esp_wifi_set_config (ESP_IF_WIFI_STA, &cfg);
               esp_wifi_connect ();
               // Get IP?
               esp_netif_dhcpc_stop (sta_netif);
               esp_netif_dhcpc_start (sta_netif);       /* Dynamic IP */
               int waiting = 10;
               while (waiting--)
               {
                  sleep (1);
                  esp_netif_ip_info_t ip;
                  if (!esp_netif_get_ip_info (sta_netif, &ip) && ip.ip.addr)
                  {
                     // What if no IP yet - check IP 0
                     // What if access via STA so we already have an IP
                     jo_t i = jo_object_alloc ();
                     jo_stringf (i, "ip", IPSTR, IP2STR (&ip.ip));
                     jo_stringf (i, "mask", IPSTR, IP2STR (&ip.netmask));
                     jo_stringf (i, "gw", IPSTR, IP2STR (&ip.gw));
                     wsend (&i);
                     ok = 1;
                     break;
                  }
               }
            }
            if (ok)
            {
               revk_setting (j);
            } else if (upgrade)
            {
               revk_command ("upgrade", NULL);
               msg ("Upgrading");
            } else
            {
               if (ret)
                  msg ("Failed to connect");
               else
                  msg ("Failed to get IP");
               esp_wifi_set_mode (mode);
            }
         }
         jo_free (&j);
      }
   }
   free (buf);
   return ret;
}
#else
#ifndef CONFIG_IDF_TARGET_ESP8266
#warning	You may want CONFIG_HTTPD_WS_SUPPORT
#endif
#endif // CONFIG_HTTPD_WS_SUPPORT
#endif // CONFIG_REVK_APMODE

