revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_APDNS
static void
dummy_dns_task (void *pvParameters)
{
   int sock = socket (AF_INET, SOCK_DGRAM, IPPROTO_IP);
   if (sock >= 0)
   {
      int res = 1;
      setsockopt (sock, SOL_SOCKET, SO_REUSEADDR, &res, sizeof (res));
      {                         // Bind
         struct sockaddr_in dest_addr_ip4 = {.sin_addr.s_addr = htonl (INADDR_ANY),.sin_family = AF_INET,.sin_port = htons (53) };
         res = bind (sock, (struct sockaddr *) &dest_addr_ip4, sizeof (dest_addr_ip4));
      }
      if (!res)
      {
         ESP_LOGI (TAG, "Dummy DNS start");
         while (!dummy_dns_task_end)
         {                      // Process
            fd_set r;
            FD_ZERO (&r);
            FD_SET (sock, &r);
            struct timeval t = { 1, 0 };
            res = select (sock + 1, &r, NULL, NULL, &t);
            if (res < 0)
               break;
            if (!res)
               continue;
            uint8_t buf[1500];
            struct sockaddr_storage source_addr;
            socklen_t socklen = sizeof (source_addr);
            res = recvfrom (sock, buf, sizeof (buf) - 1, 0, (struct sockaddr *) &source_addr, &socklen);
            //ESP_LOG_BUFFER_HEX_LEVEL(TAG, buf, res, ESP_LOG_INFO);
            // Check this looks like a simple query, and answer A record
            if (res < 12)
               continue;        // Too short
            if (buf[2] & 0xFE)
               continue;        // Check simple QUERY
            if (buf[4] || buf[5] != 1 || buf[6] || buf[7] || buf[8] || buf[9])
               continue;        // Wrong counts
            int p = 12;         // Start of DNS
            while (p < res && buf[p])
               p += buf[p] + 1;
            p++;
            if (p + 4 > res)
               continue;        // Length issue
            if (buf[p] || buf[p + 1] != 1)
               continue;        // Not A record query
            p += 2;
            if (buf[p] || buf[p + 1] != 1)
               continue;        // Not IN class
            p += 2;
            // Let's answer
            buf[2] = 0x84;      // Response
            buf[3] = 0x00;
            buf[7] = 1;         // ANCOUNT=1
            buf[10] = 0;        // ARCOUNT=0
            buf[11] = 0;
            buf[p++] = 0xC0;
            buf[p++] = 12;      // Name from query
            buf[p++] = 0;
            buf[p++] = 1;       // A
            buf[p++] = 0;
            buf[p++] = 1;       // IN
            buf[p++] = 0;
            buf[p++] = 0;
            buf[p++] = 0;
            buf[p++] = 1;       // TTL 1
            buf[p++] = 0;
            buf[p++] = 4;       // Len 4
            buf[p++] = 10;
            buf[p++] = (uint8_t) (revk_binid >> 8);
            buf[p++] = (uint8_t) (revk_binid & 255);
            buf[p++] = 1;       // IP
            // Send reply
            sendto (sock, buf, p, 0, (struct sockaddr *) &source_addr, socklen);
            ESP_LOGI (TAG, "Dummy DNS reply (stack free %d)", uxTaskGetStackHighWaterMark (NULL));
         }
         ESP_LOGI (TAG, "Dummy DNS stop");
      }
      close (sock);
   }
   vTaskDelete (NULL);
}
#endif

#ifdef	CONFIG_REVK_APMODE
static void
ap_start (void)
{
   apstoptime = 0;
   if (*apssid)
      return;                   // We are running an AP mode configured, don't do special APMODE
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA)
      return;
   // WiFi
   wifi_config_t cfg = { 0, };
#ifdef	CONFIG_REVK_APDNS
   cfg.ap.ssid_len = snprintf ((char *) cfg.ap.ssid, sizeof (cfg.ap.ssid), "%s-%012llX", appname, revk_binid);
#else
   cfg.ap.ssid_len =
      snprintf ((char *) cfg.ap.ssid, sizeof (cfg.ap.ssid), "%s-10.%d.%d.1", appname, (uint8_t) (revk_binid >> 8),
                (uint8_t) (revk_binid & 255));
#endif
   if (cfg.ap.ssid_len > sizeof (cfg.ap.ssid))
      cfg.ap.ssid_len = sizeof (cfg.ap.ssid);
   ESP_LOGI (TAG, "AP%s config mode start %.*s", mode == WIFI_MODE_STA ? "STA" : "", cfg.ap.ssid_len, cfg.ap.ssid);
   cfg.ap.max_connection = 255;
   // DHCP
   esp_netif_ip_info_t info = {
      0,
   };
   IP4_ADDR (&info.ip, 10, revk_binid >> 8, revk_binid, 1);
   info.gw = info.ip;           /* We are the gateway */
   IP4_ADDR (&info.netmask, 255, 255, 255, 0);
   REVK_ERR_CHECK (esp_netif_dhcps_stop (ap_netif));
   REVK_ERR_CHECK (esp_netif_set_ip_info (ap_netif, &info));
   REVK_ERR_CHECK (esp_netif_dhcps_start (ap_netif));
#ifdef	CONFIG_REVK_APCONFIG
   // Web server
   httpd_config_t config = HTTPD_DEFAULT_CONFIG ();
   if (apport)
      config.server_port = apport;
   /* Empty handle to esp_http_server */
   if (!httpd_start (&webserver, &config))
   {
      {
         httpd_uri_t uri = {
            .uri = "/",
            .method = HTTP_GET,
            .handler = revk_web_config,
         };
         REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
      }
      revk_web_config_start (webserver);
   }
#endif
#ifdef	CONFIG_REVK_APDNS
   dummy_dns_task_end = 0;
   revk_task ("DNS", dummy_dns_task, NULL, 5);
#endif
   // Make it go
   esp_wifi_set_mode (mode == WIFI_MODE_STA ? WIFI_MODE_APSTA : WIFI_MODE_AP);
   REVK_ERR_CHECK (esp_wifi_set_protocol (ESP_IF_WIFI_AP, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N));
   REVK_ERR_CHECK (esp_wifi_set_config (ESP_IF_WIFI_AP, &cfg));
}
#endif

#ifdef	CONFIG_REVK_APMODE
static void
ap_stop (void)
{
   apstoptime = 0;
   if (*apssid)
      return;                   // We are running an AP mode configured, don't do special APMODE
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode != WIFI_MODE_APSTA && mode != WIFI_MODE_AP)
      return;                   // Not in AP mode
   ESP_LOGI (TAG, "AP config mode stop");
   REVK_ERR_CHECK (esp_netif_dhcps_stop (ap_netif));
#ifdef  CONFIG_REVK_APCONFIG
   if (webserver)
      httpd_stop (webserver);
   webserver = NULL;
#endif
#ifdef  CONFIG_WIFI_APDNS
   dummy_dns_task_end = 1;
#endif
   esp_wifi_set_mode (mode == WIFI_MODE_APSTA ? WIFI_MODE_STA : WIFI_MODE_NULL);
}
#endif

static void
ota_task (void *pvParameters)
{
   char *url = pvParameters;
   esp_http_client_config_t config = {
      .url = url
   };
#ifndef	ESP_IDF_431             // Old version does not have
   /* Set the TLS in case redirect to TLS even if http */
   if (otacert->len)
   {
      config.cert_pem = (void *) otacert->data;
      config.cert_len = otacert->len;
   } else
#ifdef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
      config.crt_bundle_attach = esp_crt_bundle_attach;
#else
      config.use_global_ca_store = true;        /* Global cert */
#endif
   if (clientcert->len && clientkey->len)
   {
      config.client_cert_pem = (void *) clientcert->data;
      config.client_cert_len = clientcert->len;
      config.client_key_pem = (void *) clientkey->data;
      config.client_key_len = clientkey->len;
   }
#endif
   esp_http_client_handle_t client = esp_http_client_init (&config);
   if (!client)
   {
      jo_t j = jo_object_alloc ();
      jo_string (j, "description", "HTTP client failed");
      jo_string (j, "url", url);
      revk_error ("upgrade", &j);
   } else
   {
      int status = 0;
      int ota_size = 0;
      esp_err_t err = REVK_ERR_CHECK (esp_http_client_open (client, 0));
      if (!err)
         ota_size = esp_http_client_fetch_headers (client);
      if (!err && ota_size && (status = esp_http_client_get_status_code (client)) / 100 == 2)
      {
         ESP_LOGI (TAG, "OTA %s", url);
#ifdef  CONFIG_REVK_MESH
         int ota_data = 0;
         uint8_t block[MESH_MPS];
         int blockp = 0;
         void send_ota (void)
         {
            mesh_data_t data = {.proto = MESH_PROTO_BIN,.size = blockp,.data = block };
            mesh_ota_ack = 0xA0 + (*block & 0x0F);      // The ACK we want
            mesh_safe_send (&mesh_ota_addr, &data, MESH_DATA_P2P, NULL, 0);
            int try = 10;
            while (!xSemaphoreTake (mesh_ota_sem, 500 / portTICK_PERIOD_MS) && --try)
               mesh_safe_send (&mesh_ota_addr, &data, MESH_DATA_P2P, NULL, 0);  // Resend
            if (!try)
            {
               ESP_LOGE (TAG, "Send timeout %02X", *data.data);
               ota_size = 0;
            }
            blockp = 1;
            *block = 0xD0 + ((*block + 1) & 0xF);       // Next data block
         }
         blockp = 0;
         block[blockp++] = 0x50;        // Start[0]
         block[blockp++] = (ota_size >> 16);
         block[blockp++] = (ota_size >> 8);
         block[blockp++] = ota_size;
         send_ota ();
         sleep (5);             // Erase
         while (!err && ota_data < ota_size)
         {
            int len = esp_http_client_read_response (client, (char *) block + blockp, sizeof (block) - blockp);
            if (len <= 0)
               break;
            blockp += len;
            send_ota ();
         }
         if (!err && ota_size)
         {                      // End
            if (blockp > 1)
               send_ota ();     // Last data block
            blockp = 0;
            block[blockp++] = 0xE0 + (*block & 0xF);    // End
            send_ota ();
         }
#else
         esp_ota_handle_t ota_handle;
         const esp_partition_t *ota_partition = NULL;
         int ota_progress = 0;
         int ota_data = 0;
         uint32_t next = 0;
         uint32_t now = uptime ();
         if (!ota_partition)
            ota_partition = esp_ota_get_running_partition ();
         ota_partition = esp_ota_get_next_update_partition (ota_partition);
         if (!ota_partition)
         {
            jo_t j = jo_object_alloc ();
            jo_string (j, "description", "No OTA partition available");
            revk_error ("upgrade", &j);
            ota_size = 0;
         } else
         {
            jo_t j = jo_make (NULL);
            jo_string (j, "partition", ota_partition->label);
            jo_stringf (j, "start", "%X", ota_partition->address);
            jo_int (j, "space", ota_partition->size);
            jo_int (j, "size", ota_size);
            revk_info ("upgrade", &j);
            if (!(err = REVK_ERR_CHECK (esp_ota_begin (ota_partition, ota_size, &ota_handle))))
               next = now + 5;
            while (!err && ota_data < ota_size)
            {
               uint8_t buf[1024];
               int len = esp_http_client_read_response (client, (void *) buf, sizeof (buf));
               if (len <= 0)
                  break;
               if ((err = REVK_ERR_CHECK (esp_ota_write (ota_handle, buf, len))))
                  break;
               if (!ota_data)
                  revk_restart ("OTA Download started", 10);
               else if (ota_data < ota_size / 2 && (ota_data + len) >= ota_size / 2)
                  revk_restart ("OTA Download progress", 10);
               ota_data += len;
               now = uptime ();
               int percent = ota_data * 100 / ota_size;
               if (percent != ota_progress && (percent == 100 || next < now || percent / 10 != ota_progress / 10))
               {
                  ESP_LOGI (TAG, "Flash %d%%", percent);
                  jo_t j = jo_make (NULL);
                  jo_int (j, "size", ota_size);
                  jo_int (j, "loaded", ota_data);
                  jo_int (j, "progress", ota_progress = percent);
                  revk_info_clients ("upgrade", &j, -1);
                  next = now + 5;
               }
            }
            // End
            if (!err && !(err = REVK_ERR_CHECK (esp_ota_end (ota_handle))))
            {
               jo_t j = jo_make (NULL);
               jo_int (j, "size", ota_size);
               jo_string (j, "complete", ota_partition->label);
               revk_info_clients ("upgrade", &j, -1);
               esp_ota_set_boot_partition (ota_partition);
               revk_restart ("OTA Download complete", 3);
            } else
               revk_restart ("OTA Download fail", 3);
         }
#endif
      }
      REVK_ERR_CHECK (esp_http_client_cleanup (client));
      if (err || status / 100 != 2 || ota_size < 0)
         if (!err && status / 100 != 2)
         {
            jo_t j = jo_make (NULL);
            if (ota_size >= 0)
               jo_int (j, "size", ota_size);
            jo_string (j, "url", url);
            if (err)
            {
               jo_int (j, "code", err);
               jo_string (j, "description", esp_err_to_name (err));
            }
            if (status)
               jo_int (j, "status", status);
            revk_error ("upgrade", &j);
         }
   }
   freez (url);
   ota_task_id = NULL;
   ESP_LOGI (TAG, "OTA: Stack spare %d", uxTaskGetStackHighWaterMark (NULL));
   vTaskDelete (NULL);
}

static int
nvs_get (setting_t * s, const char *tag, void *data, size_t len)
{                               /* Low level get logic, returns < 0 if error.Calls the right nvs get function for type of setting */
   esp_err_t err;
   if (s->flags & SETTING_BINDATA)
   {
      if (s->size || !data)
      {                         // Fixed size, or getting len
         if ((err = nvs_get_blob (s->nvs, tag, data, &len)) != ERR_OK)
            return -err;
         if (!s->size)
            len += sizeof (revk_bindata_t);
         return len;
      }
      len -= sizeof (revk_bindata_t);
      revk_bindata_t *d = data;
      d->len = len;
      if ((err = nvs_get_blob (s->nvs, tag, d->data, &len)) != ERR_OK)
         return -err;
      return len + sizeof (revk_bindata_t);
   }
   if (s->size == 0)
   {                            /* String */
      if ((err = nvs_get_str (s->nvs, tag, data, &len)) != ERR_OK)
         return -err;
      return len;
   }
   uint64_t temp;
   if (!data)
      data = &temp;
   if (s->flags & SETTING_SIGNED)
   {
      if (s->size == 8)
      {                         /* int64 */
         if ((err = nvs_get_i64 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 8;
      }
      if (s->size == 4)
      {                         /* int32 */
         if ((err = nvs_get_i32 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 4;
      }
      if (s->size == 2)
      {                         /* int16 */
         if ((err = nvs_get_i16 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 2;
      }
      if (s->size == 1)
      {                         /* int8 */
         if ((err = nvs_get_i8 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 1;
      }
   } else
   {
      if (s->size == 8)
      {                         /* uint64 */
         if ((err = nvs_get_u64 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 8;
      }
      if (s->size == 4)
      {                         /* uint32 */
         if ((err = nvs_get_u32 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 4;
      }
      if (s->size == 2)
      {                         /* uint16 */
         if ((err = nvs_get_u16 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 2;
      }
      if (s->size == 1)
      {                         /* uint8 */
         if ((err = nvs_get_u8 (s->nvs, tag, data)) != ERR_OK)
            return -err;
         return 1;
      }
   }
   return -999;
}

static esp_err_t
nvs_set (setting_t * s, const char *tag, void *data)
{                               /* Low level set logic, returns < 0 if error. Calls the right nvs set function for type of setting */
   if (s->flags & SETTING_BINDATA)
   {
      if (s->size)
         return nvs_set_blob (s->nvs, tag, data, s->size);      // Fixed size - just store
      // Variable size, store the size it is
      revk_bindata_t *d = data;
      return nvs_set_blob (s->nvs, tag, d->data, d->len);       // Variable
   }
   if (s->size == 0)
      return nvs_set_str (s->nvs, tag, data);
   if (s->flags & SETTING_SIGNED)
   {
      if (s->size == 8)
         return nvs_set_i64 (s->nvs, tag, *((int64_t *) data));
      if (s->size == 4)
         return nvs_set_i32 (s->nvs, tag, *((int32_t *) data));
      if (s->size == 2)
         return nvs_set_i16 (s->nvs, tag, *((int16_t *) data));
      if (s->size == 1)
         return nvs_set_i8 (s->nvs, tag, *((int8_t *) data));
   } else
   {
      if (s->size == 8)
         return nvs_set_u64 (s->nvs, tag, *((uint64_t *) data));
      if (s->size == 4)
         return nvs_set_u32 (s->nvs, tag, *((uint32_t *) data));
      if (s->size == 2)
         return nvs_set_u16 (s->nvs, tag, *((uint16_t *) data));
      if (s->size == 1)
         return nvs_set_u8 (s->nvs, tag, *((uint8_t *) data));
   }
   ESP_LOGE (TAG, "Not saved setting %s", tag);
   return -1;
}

