revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
static const char *
revk_setting_internal (setting_t * s, unsigned int len, const unsigned char *value, unsigned char index, int flags)
{                               // Value is expected to already be binary if using binary
   flags |= s->flags;
   {                            // Overlap check
      setting_t *q;
      for (q = setting; q && q->data != s->data; q = q->next);
      if (q)
         s = q;
   }
   void *data = s->data;
   if (s->array)
   {
      if (index >= s->array)
         return "Bad index";
      if (s->array && index && !(flags & SETTING_BOOLEAN))
         data += index * (s->size ? : sizeof (void *));
   }
   // TODO we should not have suffix on index 1, that is just silly, but change needs backwards compatibility...
   char tag[16];                /* Max NVS name size */
   if (snprintf (tag, sizeof (tag), s->array ? "%s%u" : "%s", s->name, index + 1) >= sizeof (tag))
   {
      ESP_LOGE (TAG, "Setting %s%u too long", s->name, index + 1);
      return "Setting name too long";
   }
   ESP_LOGD (TAG, "MQTT setting %s (%d)", tag, len);
   char erase = 0;
   /* Using default, so remove from flash (as defaults may change later, don't store the default in flash) */
   unsigned char *temp = NULL;  // Malloc'd space to be freed
   const char *defval = s->defval;
   if (defval && (flags & SETTING_BITFIELD))
   {                            /* default is after bitfields and a space */
      while (*defval && *defval != ' ')
         defval++;
      if (*defval == ' ')
         defval++;
   }
   if (defval && *defval == '"')
      defval++;                 // Bodge
   if (defval && index)
   {
      if (!s->size)
         defval = NULL;         // Not first value so no def if a string
      else
      {                         // Allow space separated default if not a string
         int i = index;
         while (i-- && *defval)
         {
            while (*defval && *defval != ' ')
               defval++;
            if (*defval == ' ')
               defval++;
         }
         if (!*defval)
            defval = NULL;      // No def if no more values
      }
   }
   if (!len && defval && !value)
   {                            /* Use default value */
      if (s->flags & SETTING_BINDATA)
      {                         // Convert to binary
         jo_t j = jo_create_alloc ();
         jo_string (j, NULL, defval);
         jo_rewind (j);
         int l;
         if (s->flags & SETTING_HEX)
         {
            l = jo_strncpy16 (j, NULL, 0);
            if (l > 0)
               jo_strncpy16 (j, temp = malloc (l), l);
         } else
         {
            l = jo_strncpy64 (j, NULL, 0);
            if (l > 0)
               jo_strncpy64 (j, temp = malloc (l), l);
         }
         value = temp;          // temp gets freed at end
         len = l;
         jo_free (&j);
      } else
      {
         len = strlen (defval);
         value = (const unsigned char *) defval;
      }
      erase = 1;
   }
   if (!value)
   {
      defval = "";
      value = (const unsigned char *) defval;
      erase = 1;
   } else
      s->set = 1;
#ifdef SETTING_DEBUG
   if (s->flags & SETTING_BINDATA)
      ESP_LOGI (TAG, "%s=(%d bytes)", (char *) tag, len);
   else
      ESP_LOGI (TAG, "%s=%.*s", (char *) tag, len, (char *) value);
#endif
   const char *parse (void)
   {
      /* Parse new setting */
      unsigned char *n = NULL;
      int l = len;
      if (flags & SETTING_BINDATA)
      {                         /* Blob */
         unsigned char *o;
         if (!s->size)
         {                      /* Dynamic */
            l += sizeof (revk_bindata_t);
            revk_bindata_t *d = malloc (l);
            o = n = (void *) d;
            if (o)
            {
               d->len = len;
               if (len)
                  memcpy (d->data, value, len);
            }
         } else
         {                      // Fixed size binary
            if (l && l != s->size)
               return "Wrong size";
            o = n = malloc (s->size);
            if (o)
            {
               if (l)
                  memcpy (o, value, l);
               else
                  memset (o, 0, l = s->size);
            }
         }
      } else if (!s->size)
      {                         /* String */
         l++;
         n = malloc (l);        /* One byte for null termination */
         if (len)
            memcpy (n, value, len);
         n[len] = 0;
      } else
      {                         /* Numeric */
         uint64_t v = 0;
         if (flags & SETTING_BOOLEAN)
         {                      /* Boolean */
            if (s->size == 1)
               v = *(uint8_t *) data;
            else if (s->size == 2)
               v = *(uint16_t *) data;
            else if (s->size == 4)
               v = *(uint32_t *) data;
            else if (s->size == 8)
               v = *(uint64_t *) data;
            if (len && strchr ("YytT1", *value))
               v |= (1ULL << index);
            else
               v &= ~(1ULL << index);
         } else
         {
            char neg = 0;
            int bits = s->size * 8;
            uint64_t bitfield = 0;
            if (flags & SETTING_SET)
            {                   /* Set top bit if a value is present */
               bits--;
               if (len && *value != ' ' && *value != '"')
                  bitfield |= (1ULL << bits);
            }
            if ((flags & SETTING_BITFIELD) && s->defval)
            {                   /* Bit fields */
               while (len)
               {
                  const char *c = s->defval;
                  while (*c && *c != ' ' && *c != *value)
                     c++;
                  if (*c != *value)
                     break;
                  uint64_t m = (1ULL << (bits - 1 - (c - s->defval)));
                  if (bitfield & m)
                     break;
                  bitfield |= m;
                  len--;
                  value++;
               }
               const char *c = s->defval;
               while (*c && *c != ' ')
                  c++;
               bits -= (c - s->defval);
            }
            if (len && bits <= 0)
               return "Extra data on end";
            if (len > 2 && *value == '0' && value[1] == 'x')
            {
               flags |= SETTING_HEX;
               len -= 2;
               value += 2;
            }
            if (len && *value == '-' && (flags & SETTING_SIGNED))
            {                   /* Decimal */
               len--;
               value++;
               neg = 1;
            }
            if (flags & SETTING_HEX)
               while (len && isxdigit (*value))
               {                /* Hex */
                  uint64_t n = v * 16 + (isalpha (*value) ? 9 : 0) + (*value & 15);
                  if (n < v)
                     return "Silly number";
                  v = n;
                  value++;
                  len--;
            } else
               while (len && isdigit (*value))
               {
                  uint64_t n = v * 10 + (*value++ - '0');
                  if (n < v)
                     return "Silly number";
                  v = n;
                  len--;
               }
            if (len && *value != ' ' && *value != '"')
               return "Bad number";     // Allow space - used for multiple defval
            if (flags & SETTING_SIGNED)
               bits--;
            if (bits < 0 || (bits < 64 && ((v - (v && neg ? 1 : 0)) >> bits)))
               return "Number too big";
            if (neg)
               v = -v;
            if (flags & SETTING_SIGNED)
               bits++;
            if (bits < 64)
               v &= (1ULL << bits) - 1;
            v |= bitfield;
         }
         if (flags & SETTING_SIGNED)
         {
            if (s->size == 8)
               *((int64_t *) (n = malloc (l = 8))) = v;
            else if (s->size == 4)
               *((int32_t *) (n = malloc (l = 4))) = v;
            else if (s->size == 2)
               *((int16_t *) (n = malloc (l = 2))) = v;
            else if (s->size == 1)
               *((int8_t *) (n = malloc (l = 1))) = v;
         } else
         {
            if (s->size == 8)
               *((int64_t *) (n = malloc (l = 8))) = v;
            else if (s->size == 4)
               *((int32_t *) (n = malloc (l = 4))) = v;
            else if (s->size == 2)
               *((int16_t *) (n = malloc (l = 2))) = v;
            else if (s->size == 1)
               *((int8_t *) (n = malloc (l = 1))) = v;
         }
      }
      if (!n)
         return "Bad setting type";
      /* See if setting has changed */
      int o = nvs_get (s, tag, NULL, 0);        // Get length
#ifdef SETTING_DEBUG
      if (o < 0 && o != -ESP_ERR_NVS_NOT_FOUND)
         ESP_LOGI (TAG, "Setting %s nvs read fail %s", tag, esp_err_to_name (-o));
#endif
      if (o != l)
      {
#if defined(SETTING_DEBUG) || defined(SETTING_CHANGED)
         if (o >= 0)
            ESP_LOGI (TAG, "Setting %s different len %d/%d", tag, o, l);
#endif
         o = -1;                /* Different size */
      }
      if (o > 0)
      {
         unsigned char *d = malloc (l);
         if (nvs_get (s, tag, d, l) != o)
         {
            freez (n);
            freez (d);
            return "Bad setting get";
         }
         if (memcmp (n, d, o))
         {
#if defined(SETTING_DEBUG) || defined(SETTING_CHANGED)
            ESP_LOGI (TAG, "Setting %s different content %d (%02X%02X%02X%02X/%02X%02X%02X%02X)", tag, o, d[0], d[1], d[2], d[3],
                      n[0], n[1], n[2], n[3]);
#endif
            o = -1;             /* Different content */
         }
         freez (d);
      }
      if (o < 0)
      {                         /* Flash changed */
         if (erase && !(flags & SETTING_FIX))
         {
            esp_err_t __attribute__((unused)) err = nvs_erase_key (s->nvs, tag);
            if (err == ESP_ERR_NVS_NOT_FOUND)
               o = 0;
#if defined(SETTING_DEBUG) || defined(SETTING_CHANGED)
            else
               ESP_LOGI (TAG, "Setting %s erased", tag);
#endif
         } else
         {
            if (nvs_set (s, tag, n) != ERR_OK && (nvs_erase_key (s->nvs, tag) != ERR_OK || nvs_set (s, tag, n) != ERR_OK))
            {
               freez (n);
               return "Unable to store";
            }
#if defined(SETTING_DEBUG) || defined(SETTING_CHANGED)
            if (flags & SETTING_BINDATA)
               ESP_LOGI (TAG, "Setting %s stored (%d)", tag, len);
            else
               ESP_LOGI (TAG, "Setting %s stored %.*s", tag, len, value);
#endif
         }
         nvs_time = uptime () + 60;
      }
      if (flags & SETTING_LIVE)
      {                         /* Store changed value in memory live */
         if (!s->size)
         {                      /* Dynamic */
            void *o = *((void **) data);
            /* See if different */
            if (!o || ((flags & SETTING_BINDATA) ? memcmp (o, n, len) : strcmp (o, (char *) n)))
            {
               *((void **) data) = n;
               freez (o);
            } else
               freez (n);       /* No change */
         } else
         {                      /* Static (try and make update atomic) */
            if (s->size == 1)
               *(uint8_t *) data = *(uint8_t *) n;
            else if (s->size == 2)
               *(uint16_t *) data = *(uint16_t *) n;
            else if (s->size == 4)
               *(uint32_t *) data = *(uint32_t *) n;
            else if (s->size == 8)
               *(uint64_t *) data = *(uint64_t *) n;
            else
               memcpy (data, n, s->size);
            freez (n);
         }
      } else if (o < 0)
         revk_restart ("Settings changed", 5);
      return NULL;
   }
   const char *fail = parse ();
   freez (temp);
   return fail;                 /* OK */
}

static const char *
revk_setting_dump (void)
{                               // Dump settings (in JSON)
   const char *err = NULL;
   jo_t j = NULL;
   void send (void)
   {
      if (!j)
         return;
      revk_mqtt_send (prefixsetting, 0, NULL, &j);
   }
   int maxpacket = MQTT_MAX;
   maxpacket -= 50;             // for headers
#ifdef	CONFIG_REVK_MESH
   maxpacket -= MESH_PAD;
#endif
   char buf[maxpacket];         // Allows for topic, header, etc
   const char *hasdef (setting_t * s)
   {
      const char *d = s->defval;
      if (!d)
         return NULL;
      if (s->flags & SETTING_BITFIELD)
      {
         while (*d && *d != ' ')
            d++;
         if (*d == ' ')
            d++;
      }
      if (!*d)
         return NULL;
      if ((s->flags & SETTING_BOOLEAN) && !strchr ("YytT1", *d))
         return NULL;
      if (s->size && !strcmp (d, "0"))
         return NULL;
      return d;
   }
   int isempty (setting_t * s, int n)
   {                            // Check empty
      if (s->flags & SETTING_BOOLEAN)
      {                         // This is basically testing it is false
         uint64_t v = 0;
         if (s->size == 1)
            v = *(uint8_t *) s->data;
         else if (s->size == 2)
            v = *(uint16_t *) s->data;
         else if (s->size == 4)
            v = *(uint32_t *) s->data;
         else if (s->size == 8)
            v = *(uint64_t *) s->data;
         if (v & (1ULL << n))
            return 0;
         return 1;              // Empty bool
      }
      void *data = s->data + (s->size ? : sizeof (void *)) * n;
      int q = s->size;
      if (!q)
      {
         char *p = *(char **) data;
         if (!p || !*p)
            return 2;           // Empty string
         return 0;
      }
      while (q && !*(char *) data)
      {
         q--;
         data++;
      }
      if (!q)
         return 3;              // Empty value
      return 0;
   }
   setting_t *s;
   for (s = setting; s; s = s->next)
   {
      if ((!(s->flags & SETTING_SECRET) || s->parent) && !s->child)
      {
         int max = 0;
         if (s->array)
         {                      // Work out m - for now, parent items in arrays have to be set for rest to be output - this is the rule...
            max = s->array;
            if (!(s->flags & SETTING_BOOLEAN))
               while (max && isempty (s, max - 1))
                  max--;
         }
         jo_t p = NULL;
         void start (void)
         {
            if (!p)
            {
               if (j)
                  p = jo_copy (j);
               else
               {
                  p = jo_create_mem (buf, maxpacket);
                  jo_object (p, NULL);
               }
            }
         }
         const char *failed (void)
         {
            err = NULL;
            if (p && (err = jo_error (p, NULL)))
               jo_free (&p);    // Did not fit
            return err;
         }
         void addvalue (setting_t * s, const char *tag, int n)
         {                      // Add a value
            start ();
            void *data = s->data;
            const char *defval = s->defval ? : "";
            if (!(s->flags & SETTING_BOOLEAN))
               data += (s->size ? : sizeof (void *)) * n;
            if (s->flags & SETTING_BINDATA)
            {                   // Binary data
               int len = s->size;
               if (!len)
               {                // alloc'd with len at start
                  revk_bindata_t *d = *(void **) data;
                  len = d->len;
                  data = d->data;
               }
               if (s->flags & SETTING_HEX)
                  jo_base16 (p, tag, data, len);
               else
                  jo_base64 (p, tag, data, len);
            } else if (!s->size)
            {
               char *v = *(char **) data;
               if (v)
               {
                  jo_string (p, tag, v);        // String
               } else
                  jo_null (p, tag);     // Null string - should not happen
            } else
            {
               uint64_t v = 0;
               if (s->size == 1)
                  v = *(uint8_t *) data;
               else if (s->size == 2)
                  v = *(uint16_t *) data;
               else if (s->size == 4)
                  v = *(uint32_t *) data;
               else if (s->size == 8)
                  v = *(uint64_t *) data;
               if (s->flags & SETTING_BOOLEAN)
               {
                  jo_bool (p, tag, (v >> n) & 1);
               } else
               {                // numeric
                  char temp[100],
                   *t = temp;
                  uint8_t bits = s->size * 8;
                  if (s->flags & SETTING_SET)
                     bits--;
                  if (!(s->flags & SETTING_SET) || ((v >> bits) & 1))
                  {
                     if (s->flags & SETTING_BITFIELD)
                     {
                        while (*defval && *defval != ' ')
                        {
                           bits--;
                           if ((v >> bits) & 1)
                              *t++ = *defval;
                           defval++;
                        }
                        if (*defval == ' ')
                           defval++;
                     }
                     if (s->flags & SETTING_SIGNED)
                     {
                        bits--;
                        if ((v >> bits) & 1)
                        {
                           *t++ = '-';
                           v = (v ^ ((1ULL << bits) - 1)) + 1;
                        }
                     }
                     v &= ((1ULL << bits) - 1);
                     if (s->flags & SETTING_HEX)
                        t += sprintf (t, "%llX", v);
                     else if (bits)
                        t += sprintf (t, "%llu", v);
                  }
                  *t = 0;
                  t = temp;
                  if (*t == '-')
                     t++;
                  if (*t == '0')
                     t++;
                  else
                     while (*t >= '0' && *t <= '9')
                        t++;
                  if (t == temp || *t || (s->flags & SETTING_HEX))
                     jo_string (p, tag, temp);
                  else
                     jo_lit (p, tag, temp);
               }
            }
         }
         void addsub (setting_t * s, const char *tag, int n)
         {                      // n is 0 based
            if (s->parent)
            {
               if (!tag || (!n && hasdef (s)) || !isempty (s, n))
               {
                  start ();
                  jo_object (p, tag);
                  setting_t *q;
                  for (q = setting; q; q = q->next)
                     if (q->child && !strncmp (q->name, s->name, s->namelen))
                        if ((!n && hasdef (q)) || !isempty (q, n))
                           addvalue (q, q->name + s->namelen, n);
                  jo_close (p);
               }
            } else
               addvalue (s, tag, n);
         }
         void addsetting (void)
         {                      // Add a whole setting
            if (s->parent)
            {
               if (s->array)
               {                // Array above
                  if (max || hasdef (s))
                  {
                     start ();
                     jo_array (p, s->name);
                     for (int n = 0; n < max; n++)
                        addsub (s, NULL, n);
                     jo_close (p);
                  }
               } else
                  addsub (s, s->name, 0);
            } else if (s->array)
            {
               if (max || hasdef (s))
               {
                  start ();
                  jo_array (p, s->name);
                  for (int n = 0; n < max; n++)
                     addvalue (s, NULL, n);
                  jo_close (p);
               }
            } else if (hasdef (s) || !isempty (s, 0))
               addvalue (s, s->name, 0);
         }
         addsetting ();
         if (failed () && j)
         {
            send ();            // Failed, clear what we were sending and try again
            addsetting ();
         }
         if (failed () && s->array)
         {                      // Failed, but is an array, so try each setting individually
            for (int n = 0; n < max; n++)
            {
               char *tag;
               asprintf (&tag, "%s%d", s->name, n + 1);
               if (tag)
               {
                  addsub (s, tag, n);
                  if (failed () && j)
                  {
                     send ();   // Failed, clear what we were sending and try again
                     addsub (s, tag, n);
                  }
                  if (!failed ())
                  {             // Fitted, move forward
                     jo_free (&j);
                     j = p;
                  } else
                  {
                     jo_t j = jo_make (NULL);
                     jo_string (j, "description", "Setting did not fit");
                     jo_string (j, "setting", tag);
                     if (err)
                        jo_string (j, "reason", err);
                     revk_error (TAG, &j);
                  }
                  freez (tag);
               }
            }
         }
         if (!failed ())
         {                      // Fitted, move forward
            if (p)
            {
               jo_free (&j);
               j = p;
            }
         } else
         {
            jo_t j = jo_make (NULL);
            jo_string (j, "description", "Setting did not fit");
            jo_string (j, "setting", s->name);
            if (err)
               jo_string (j, "reason", err);
            revk_error (TAG, &j);
         }
      }
   }
   send ();
   return NULL;
}

