revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
const char *
revk_setting (jo_t j)
{
   jo_rewind (j);
   if (jo_here (j) != JO_OBJECT)
      return "Not an object";
   int index = 0;
   int match (setting_t * s, const char *tag)
   {
      const char *a = s->name;
      const char *b = tag;
      while (*a && *a == *b)
      {
         a++;
         b++;
      }
      if (*a)
         return 1;              /* not matched whole name, no match */
      if (!*b)
      {
         index = 0;
         return 0;              /* Match, no index */
      }
      if (!s->array && *b)
         return 2;              /* not array, and more characters, no match */
      int v = 0;
      while (isdigit ((int) (*b)))
         v = v * 10 + (*b++) - '0';
      if (*b)
         return 3;              /* More on end after any digits, no match */
      if (!v || v > s->array)
         return 4;              /* Invalid index, no match */
      index = v - 1;
      return 0;                 /* Match, index */
   }
   const char *er = NULL;
   jo_type_t t = jo_next (j);   // Start object
   while (t == JO_TAG)
   {
#ifdef SETTING_DEBUG
      ESP_LOGI (TAG, "Setting: %.10s", jo_debug (j));
#endif
      int l = jo_strlen (j);
      if (l < 0)
         break;
      char *tag = malloc (l + 1);
      if (!tag)
         er = "Malloc";
      else
      {
         l = jo_strncpy (j, (char *) tag, l + 1);
         t = jo_next (j);       // the value
         setting_t *s;
         for (s = setting; s && match (s, tag); s = s->next);
         if (!s)
         {
            ESP_LOGI (TAG, "Unknown %s %.20s", tag, jo_debug (j));
            er = "Unknown setting";
            t = jo_skip (j);
         } else
         {
            void store (setting_t * s)
            {
               if (s->dup)
                  for (setting_t * q = setting; q; q = q->next)
                     if (!q->dup && q->data == s->data)
                     {
                        s = q;
                        break;
                     }
#ifdef SETTING_DEBUG
               if (s->array)
                  ESP_LOGI (TAG, "Store %s[%d] (type %d): %.20s", s->name, index, t, jo_debug (j));
               else
                  ESP_LOGI (TAG, "Store %s (type %d): %.20s", s->name, t, jo_debug (j));
#endif
               int l = 0;
               char *val = NULL;
               if (t == JO_NUMBER || t == JO_STRING || t >= JO_TRUE)
               {
                  if (t == JO_STRING && (s->flags & SETTING_BINDATA))
                  {
                     if (s->flags & SETTING_HEX)
                     {
                        l = jo_strncpy16 (j, NULL, 0);
                        if (l)
                           jo_strncpy16 (j, val = malloc (l), l);
                     } else
                     {
                        l = jo_strncpy64 (j, NULL, 0);
                        if (l)
                           jo_strncpy64 (j, val = malloc (l), l);
                     }
                  } else
                  {
                     l = jo_strlen (j);
                     if (l >= 0)
                        jo_strncpy (j, val = malloc (l + 1), l + 1);
                  }
                  er = revk_setting_internal (s, l, (const unsigned char *) (val ? : ""), index, 0);
               } else if (t == JO_NULL)
                  er = revk_setting_internal (s, 0, NULL, index, 0);    // Factory
               else
                  er = "Bad data type";
               freez (val);
            }
            void zap (setting_t * s)
            {                   // Erasing
               if (s->dup)
                  return;
#ifdef SETTING_DEBUG
               ESP_LOGI (TAG, "Zap %s[%d]", s->name, index);
#endif
               er = revk_setting_internal (s, 0, NULL, index, 0);       // Factory default
            }
            void storesub (void)
            {
               setting_t *q;
               for (q = setting; q; q = q->next)
                  if (q->child && q->namelen > s->namelen && !strncmp (s->name, q->name, s->namelen))
                     q->used = 0;
               t = jo_next (j); // In to object
               while (t && t != JO_CLOSE && !er)
               {
                  if (t == JO_TAG)
                  {
                     int l2 = jo_strlen (j);
                     char *tag2 = malloc (s->namelen + l2 + 1);
                     if (tag2)
                     {
                        strcpy (tag2, s->name);
                        jo_strncpy (j, (char *) tag2 + s->namelen, l2 + 1);
                        t = jo_next (j);        // To value
                        for (q = setting; q && (!q->child || strcmp (q->name, tag2)); q = q->next);
                        if (!q)
                        {
                           ESP_LOGI (TAG, "Unknown %s %.20s", tag2, jo_debug (j));
                           er = "Unknown setting";
                        } else
                        {
                           q->used = 1;
                           store (q);
                        }
                        freez (tag2);
                     }
                  }
                  t = jo_skip (j);
               }
               for (q = setting; q; q = q->next)
                  if (!q->used && q->child && q->namelen > s->namelen && !strncmp (s->name, q->name, s->namelen))
                     zap (q);
            }
            if (t == JO_OBJECT)
            {
               if (!s->parent)
                  er = "Unexpected object";
               else
                  storesub ();
            } else if (t == JO_ARRAY)
            {
               if (!s->array)
                  er = "Not an array";
               else
               {
                  t = jo_next (j);      // In to array
                  while (index < s->array && t != JO_CLOSE && !er)
                  {
                     if (t == JO_OBJECT)
                        storesub ();
                     else if (t == JO_ARRAY)
                        er = "Unexpected array";
                     else
                        store (s);
                     t = jo_next (j);
                     index++;
                  }
                  while (index < s->array)
                  {
                     zap (s);
                     if (s->parent)
                        for (setting_t * q = setting; q; q = q->next)
                           if (q->child && q->namelen > s->namelen && !strncmp (s->name, q->name, s->namelen))
                              zap (q);
                     index++;
                  }
               }
            } else
               store (s);
            t = jo_next (j);
         }
         freez (tag);
      }
   }
   return er ? : "";
}

static char *
revk_upgrade_url (const char *val)
{                               // OTA URL (malloc'd)
   char *url;                   // Passed to task
   if (!strncmp ((char *) val, "https://", 8) || !strncmp ((char *) val, "http://", 7))
      url = strdup (val);       // Whole URL provided
   else if (*val == '/')
      asprintf (&url, "%s://%s%s",
#ifdef CONFIG_SECURE_SIGNED_ON_UPDATE
                otacert->len ? "https" : "http",
#else
                "http",         /* If not signed, use http as code should be signed and this uses way less memory  */
#endif
                otahost, val);  // Leaf provided
   else
      asprintf (&url, "%s://%s/%s%s.bin",
#ifdef CONFIG_SECURE_SIGNED_ON_UPDATE
                otacert->len ? "https" : "http",
#else
                "http",         /* If not signed, use http as code should be signed and this uses way less memory  */
#endif
                *val ? val : otahost, appname, revk_build_suffix);      // Hostname provided
   return url;
}

static int
revk_upgrade_check (const char *url)
{                               // Check if upgrade needed, -ve for error, 0 for no, +ve for yes
   jo_t j = jo_make (NULL);
   jo_string (j, "url", url);
   int ret = 0;
   esp_http_client_config_t config = {
      .url = url,
   };
   esp_http_client_handle_t client = esp_http_client_init (&config);
   if (!client)
      ret = -1;
   char data[96] = { 0 };
   size_t size = 0;
   int status = 0;
   if (!ret && esp_http_client_set_header (client, "Range", "bytes=48-143"))
      ret = -2;
   if (!ret && esp_http_client_open (client, 0))
      ret = -3;
   if (!ret && (size = esp_http_client_fetch_headers (client)) != sizeof (data))
   {
      ret = -4;
      jo_int (j, "size", size);
   }
   if (!ret && (status = esp_http_client_get_status_code (client) / 100 != 2))
   {
      ret = -5;
      jo_int (j, "status", status);
   }
   if (!ret && esp_http_client_read (client, data, sizeof (data)) != sizeof (data))
      ret = -6;
   REVK_ERR_CHECK (esp_http_client_cleanup (client));
   if (!ret)
   {                            // Check version
      jo_stringf (j, "version", "%.32s", data + 0);
      jo_stringf (j, "project", "%.32s", data + 32);
      jo_stringf (j, "time", "%.16s", data + 64);
      jo_stringf (j, "date", "%.16s", data + 80);
      const esp_app_desc_t *app = esp_app_get_description ();
      if (strncmp (app->version, data + 0, 32))
      {
         ret = 1;               // Different version
         jo_string (j, "was-version", app->version);
      } else if (strncmp (app->project_name, data + 32, 32))
      {
         ret = 2;               // Different project name
         jo_string (j, "was-project", app->project_name);
      } else if (strncmp (app->date, data + 80, 16))
      {
         ret = 4;               // Different date
         jo_string (j, "was-date", app->date);
      } else if (strncmp (app->time, data + 64, 16))
      {
         ret = 4;               // Different time
         jo_string (j, "was-time", app->time);
      }
      if (!ret)
         jo_bool (j, "up-to-date", 1);
   } else
      jo_int (j, "fail", ret);
   revk_info ("upgrade", &j);
   return ret;
}

static const char *
revk_upgrade (const char *target, jo_t j)
{                               // Upgrade command
   if (ota_task_id)
      return "OTA running";
#ifdef CONFIG_REVK_MESH
   if (!esp_mesh_is_root ())
      return "";                // OK will be done by root and sent via MESH
#endif
   char val[256] = { 0 };
   if (j && jo_strncpy (j, val, sizeof (val)) < 0)
      *val = 0;
#ifdef CONFIG_REVK_MESH
   if (target && strlen (target) == 12)
   {
      ESP_LOGI (TAG, "Mesh relay upgrade %s %s", target, val);
      for (int n = 0; n < sizeof (mesh_ota_addr.addr); n++)
         mesh_ota_addr.addr[n] =
            (((target[n * 2] & 0xF) + (target[n * 2] > '9' ? 9 : 0)) << 4) + ((target[1 + n * 2] & 0xF) +
                                                                              (target[1 + n * 2] > '9' ? 9 : 0));
   } else if (target)
      return "Odd target";
   else
      memcpy (mesh_ota_addr.addr, revk_mac, 6); // Us
#endif
   char *url = revk_upgrade_url (val);
#ifdef CONFIG_REVK_MESH
   if (!target)                 // Us
#endif
   {                            // Upgrading this device (upgrade check only works for this device as comparing this device details)
      if (revk_upgrade_check (url) <= 0)
      {
         free (url);
         return "";
      }
      ESP_LOGI (TAG, "Resetting watchdog");
      REVK_ERR_CHECK (compat_task_wdt_reconfigure (false, 120 * 1000, true));
      revk_restart ("OTA Download", 30);        // Restart if download does not happen properly
#ifdef	CONFIG_NIMBLE_ENABLED
      ESP_LOGI (TAG, "Stopping any BLE");
      esp_bt_controller_disable ();     // Kill bluetooth during download
      esp_wifi_set_ps (WIFI_PS_NONE);   // Full wifi
#endif
   }
   ota_task_id = revk_task ("OTA", ota_task, url, 5);
   return "";
}

