revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
const char *
revk_command (const char *tag, jo_t j)
{
   if (!tag || !*tag)
      return NULL;
   ESP_LOGD (TAG, "MQTT command [%s]", tag);
   const char *e = NULL;
   /* My commands */
   if (!e && !strcmp (tag, "upgrade"))
      e = revk_upgrade (NULL, j);       // Called internally maybe
   if (!e && !strcmp (tag, "status"))
   {
      up_next = 0;
      e = "";
   }
   if (!e && watchdogtime && !strcmp (tag, "watchdog"))
   {                            /* Test watchdog */
      wdt_test = 1;
      return "";
   }
   if (!e && !strcmp (tag, "restart"))
      e = revk_restart ("Restart command", 3);
   if (!e && !strcmp (tag, "factory"))
   {
      char val[256];
      if (jo_strncpy (j, val, sizeof (val)) < 0)
         *val = 0;
      if (strncmp (val, revk_id, strlen (revk_id)))
         return "Bad ID";
      if (strcmp (val + strlen (revk_id), appname))
         return "Bad appname";
      esp_err_t e = nvs_flash_erase ();
      if (!e)
         e = nvs_flash_erase_partition (TAG);
      if (!e)
         revk_restart ("Factory reset", 3);
      return "";
   }
#ifdef	CONFIG_REVK_MESH
   if (!e && !strcmp (tag, "mesh"))
   {                            // Update mesh if we are root
      // esp_mesh_switch_channel(const uint8_t *new_bssid, int csa_newchan, int csa_count)
   }
#endif
#ifdef	CONFIG_REVK_APMODE
   if (!e && !strcmp (tag, "apconfig"))
   {
      ap_start ();
      return "";
   }
   if (!e && !strcmp (tag, "apstop"))
   {
      ap_stop ();
      return "";
   }
#endif
#ifdef  CONFIG_FREERTOS_USE_TRACE_FACILITY
   if (!e && !strcmp (tag, "ps"))
   {                            // Process list
      TaskStatus_t *pxTaskStatusArray;
      volatile UBaseType_t uxArraySize,
        x;
      uint32_t ulTotalRunTime;

      // Take a snapshot of the number of tasks in case it changes while this
      // function is executing.
      uxArraySize = uxTaskGetNumberOfTasks ();

      // Allocate a TaskStatus_t structure for each task.  An array could be
      // allocated statically at compile time.
      pxTaskStatusArray = pvPortMalloc (uxArraySize * sizeof (TaskStatus_t));

      if (!pxTaskStatusArray)
         return "alloc fail";

      // Generate raw status information about each task.
      uxArraySize = uxTaskGetSystemState (pxTaskStatusArray, uxArraySize, &ulTotalRunTime);

      // For each populated position in the pxTaskStatusArray array,
      // format the raw data as human readable ASCII data
      for (x = 0; x < uxArraySize; x++)
      {
         jo_t j = jo_object_alloc ();
         jo_string (j, "task", pxTaskStatusArray[x].pcTaskName);
         jo_int (j, "priority", pxTaskStatusArray[x].uxCurrentPriority);
         jo_int (j, "free-stack", pxTaskStatusArray[x].usStackHighWaterMark);
         if (ulTotalRunTime)
            jo_int (j, "load", pxTaskStatusArray[x].ulRunTimeCounter * 100 / ulTotalRunTime);
         revk_info_clients ("ps", &j, -1);
      }
      vPortFree (pxTaskStatusArray);
      return "";
   }
#endif
   return e;
}

void
revk_register (const char *name, uint8_t array, uint16_t size, void *data, const char *defval, int flags)
{                               /* Register setting (not expected to be thread safe, should be called from init) */
   ESP_LOGD (TAG, "Register %s", name);
   if (flags & SETTING_BITFIELD)
   {
      if (!defval)
         ESP_LOGE (TAG, "%s missing defval on bitfield", name);
      else if (!size)
         ESP_LOGE (TAG, "%s missing size on bitfield", name);
      else
      {
         const char *p = defval;
         while (*p && *p != ' ')
            p++;
         if ((p - defval) > 8 * size - ((flags & SETTING_SET) ? 1 : 0))
            ESP_LOGE (TAG, "%s too small for bitfield", name);
      }
   }
   setting_t *s;
   for (s = setting; s && strcmp (s->name, name); s = s->next);
   if (s)
      ESP_LOGE (TAG, "%s duplicate", name);
   s = malloc (sizeof (*s));
   memset (s, 0, sizeof (*s));
   s->nvs = nvs;
   s->name = name;
   s->namelen = strlen (name);
   s->array = array;
   s->size = size;
   s->data = data;
   s->flags = flags;
   s->defval = defval;
   s->next = setting;
   {                            // Check if sub setting - parent must be set first, and be secret and same array size
      setting_t *q;
      for (q = setting;
           q && (q->namelen >= s->namelen || strncmp (q->name, name, q->namelen) || !(q->flags & SETTING_SECRET)
                 || q->array != array); q = q->next);
      if (q)
      {
         s->child = 1;
         q->parent = 1;
         if (s->data == q->data)
            q->dup = 1;
      }
   }
   setting = s;
   memset (data, 0, (size ? : sizeof (void *)) * (!(flags & SETTING_BOOLEAN) && array ? array : 1));    /* Initialise memory */
   /* Get value */
   int get_val (const char *tag, int index)
   {
      void *data = s->data;
      if (s->array && !(flags & SETTING_BOOLEAN))
         data += (s->size ? : sizeof (void *)) * index;
      int l = -1;
      if (!s->size)
      {                         /* Dynamic */
         void *d = NULL;
         l = nvs_get (s, tag, NULL, 0);
         if (l >= 0)
         {                      // Has data
            d = malloc (l);
            l = nvs_get (s, tag, d, l);
            *((void **) data) = d;
         } else
            l = -1;             /* default */
      } else
         l = nvs_get (s, tag, data, s->size);   /* Stored static */
      return l;
   }
   const char *e;
   if (array)
   {                            /* Work through tags */
      int i;
      for (i = 0; i < array; i++)
      {
         char tag[16];          /* NVS tag size */
         if (snprintf (tag, sizeof (tag), "%s%u", s->name, i + 1) < sizeof (tag) && get_val (tag, i) < 0)
         {
            e = revk_setting_internal (s, 0, NULL, i, SETTING_LIVE | (flags & SETTING_FIX));    /* Defaulting logic */
            if (e && *e)
               ESP_LOGE (TAG, "Setting %s failed %s", tag, e);
            else
               ESP_LOGD (TAG, "Setting %s created", tag);
         }
      }
   } else if (get_val (s->name, 0) < 0)
   {                            /* Simple setting, not array */
      e = revk_setting_internal (s, 0, NULL, 0, SETTING_LIVE | (flags & SETTING_FIX));  /* Defaulting logic */
      if (e && *e)
         ESP_LOGE (TAG, "Setting %s failed %s", s->name, e);
      else
         ESP_LOGD (TAG, "Setting %s created", s->name);
   }
}

#if CONFIG_LOG_DEFAULT_LEVEL > 2
esp_err_t
revk_err_check (esp_err_t e, const char *file, int line, const char *func, const char *cmd)
{
   if (e != ERR_OK)
   {
      const char *fn = strrchr (file, '/');
      if (fn)
         fn++;
      else
         fn = file;
      ESP_LOGE (TAG, "Error %s at line %d in %s (%s)", esp_err_to_name (e), line, fn, cmd);
      jo_t j = jo_make (NULL);
      jo_int (j, "code", e);
      jo_string (j, "description", esp_err_to_name (e));
      jo_string (j, "file", fn);
      jo_int (j, "line", line);
      jo_string (j, "function", func);
      jo_string (j, "command", cmd);
      revk_error (NULL, &j);
   }
   return e;
}
#else
esp_err_t
revk_err_check (esp_err_t e)
{
   if (e != ERR_OK)
   {
      ESP_LOGE (TAG, "Error %s", esp_err_to_name (e));
      jo_t j = jo_make (NULL);
      jo_int (j, "code", e);
      jo_string (j, "description", esp_err_to_name (e));
      revk_error (NULL, &j);
   }
   return e;
}
#endif

