revk/ESP32-Faikin/ESP32/ESP32-BlueCoinT/components/ESP32-RevK/revk.c
#ifdef	CONFIG_REVK_MQTT
lwmqtt_t
revk_mqtt (int client)
{
   if (client >= MQTT_CLIENTS)
      return NULL;
   return mqtt_client[client];
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
const char *
revk_wifi (void)
{
   return wifissid;
}
#endif

void
revk_blink (uint8_t on, uint8_t off, const char *colours)
{
   blink_on = on;
   blink_off = off;
   blink_colours = colours;
}

#ifdef	CONFIG_REVK_MQTT
void
revk_mqtt_close (const char *reason)
{
   for (int client = 0; client < MQTT_CLIENTS; client++)
      if (mqtt_client[client])
      {
         lwmqtt_end (&mqtt_client[client]);
         ESP_LOGI (TAG, "MQTT%d Closed", client);
         xEventGroupWaitBits (revk_group, GROUP_MQTT_DOWN << client, false, true, 2 * 1000 / portTICK_PERIOD_MS);
      }
   ESP_LOGI (TAG, "MQTT Closed");
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
void
revk_wifi_close (void)
{
   ESP_LOGI (TAG, "WIFi Close");
#ifdef	CONFIG_REVK_MESH
   esp_mesh_stop ();
   esp_mesh_deinit ();
#endif
   dhcpc_stop ();
   esp_wifi_disconnect ();
   esp_wifi_set_mode (WIFI_MODE_NULL);
   esp_wifi_deinit ();
   ESP_LOGI (TAG, "WIFi Closed");
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
int
revk_wait_wifi (int seconds)
{
   ESP_LOGD (TAG, "Wait WiFi %d", seconds);
   return xEventGroupWaitBits (revk_group, GROUP_IP, false, true, seconds * 1000 / portTICK_PERIOD_MS) & GROUP_IP;
}
#endif

#ifdef	CONFIG_REVK_MQTT
int
revk_wait_mqtt (int seconds)
{
   ESP_LOGD (TAG, "Wait MQTT %d", seconds);
   return xEventGroupWaitBits (revk_group, GROUP_MQTT, false, true, seconds * 1000 / portTICK_PERIOD_MS) & GROUP_MQTT;
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
uint32_t
revk_link_down (void)
{
   if (!link_down)
      return 0;
   return (uptime () - link_down) ? : 1;        // How long down;
}
#endif

uint32_t
revk_shutting_down (const char **reason)
{
   if (!restart_time)
   {
      if (reason)
         *reason = NULL;
      return 0;
   }
   int left = restart_time - uptime ();
   if (left <= 0)
      left = 1;
   if (reason)
      *reason = restart_reason;
   return left;
}

jo_t
jo_make (const char *node)
{
   jo_t j = jo_object_alloc ();
   time_t now = time (0);
   if (now > 1000000000)
      jo_datetime (j, "ts", now);
   if (node && *node)
      jo_string (j, "node", node);
   else if (!node && *nodename)
      jo_string (j, "node", nodename);
   return j;
}

const char *
revk_build_date (char d[20])
{
   if (!d)
      return NULL;
   const esp_app_desc_t *app = esp_app_get_description ();
   if (!app)
      return NULL;
   const char *v = app->date;
   if (!v || strlen (v) != 11)
      return NULL;
   snprintf (d, 20, "%.4s-xx-%.2sT%.8s", v + 7, v + 4, app->time);
   const char mname[] = "JanFebMarAprMayJunJulAugSepOctNovDec";
   for (int m = 0; m < 12; m++)
      if (!strncmp (mname + m * 3, v, 3))
      {
         d[5] = '0' + (m + 1) / 10;
         d[6] = '0' + (m + 1) % 10;
         break;
      }
   if (d[8] == ' ')
      d[8] = '0';
   return d;
}
